#![allow(warnings)]
/* automatically generated by rust-bindgen 0.72.0 */

#[doc = r" If Bindgen could only determine the size and alignment of a"]
#[doc = r" type, it is represented like this."]
#[derive(PartialEq, Copy, Clone, Debug, Hash)]
#[repr(C)]
pub struct __BindgenOpaqueArray<T: Copy, const N: usize>(pub [T; N]);
impl<T: Copy + Default, const N: usize> Default for __BindgenOpaqueArray<T, N> {
    fn default() -> Self {
        Self([<T as Default>::default(); N])
    }
}
pub const false_: u32 = 0;
pub const true_: u32 = 1;
pub const MAX_USHORT_VALUE: u32 = 65535;
pub const MAX_SHORT_VALUE: u32 = 32767;
pub const MAX_UINT32_VALUE: u32 = 4294967295;
pub const MAX_INT32_VALUE: u32 = 2147483647;
pub const LENGTH_UNLIMITED: i32 = -1;
pub const DDS_MILLISEC_PER_SEC: u32 = 1000;
pub const DDS_MICROSEC_PER_SEC: u32 = 1000000;
pub const DDS_NANOSEC_PER_SEC: u32 = 1000000000;
pub const DDS_INITIALIZE_NUMBER: u32 = 13496235;
pub const DDS_ANY_SAMPLE_STATE: u32 = 4294967295;
pub const DDS_ANY_VIEW_STATE: u32 = 4294967295;
pub const DDS_ANY_INSTANCE_STATE: u32 = 4294967295;
pub const DDS_NOT_ALIVE_INSTANCE_STATE: u32 = 6;
pub const DDS_STATUS_MASK_ALL: u32 = 4294967295;
pub const DDS_STATUS_MASK_NONE: u32 = 0;
pub const PID_LIST_END: u32 = 16130;
pub const BUFFERED_PROPERTY_NUM: u32 = 16;
pub const TypeObjectSize: u32 = 64;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;

pub const ZRDDS_LOG_ENABLE_BEGIN_NUM: u32 = 7000;
pub const ZRDDS_LOG_ENABLE_END_NUM: u32 = 7000;
pub const DDS_ReturnCode_t_DDS_RETCODE_OK: DDS_ReturnCode_t = 0;
pub const DDS_ReturnCode_t_DDS_RETCODE_ERROR: DDS_ReturnCode_t = 1;
pub const DDS_ReturnCode_t_DDS_RETCODE_UNSUPPORTED: DDS_ReturnCode_t = 2;
pub const DDS_ReturnCode_t_DDS_RETCODE_BAD_PARAMETER: DDS_ReturnCode_t = 3;
pub const DDS_ReturnCode_t_DDS_RETCODE_PRECONDITION_NOT_MET: DDS_ReturnCode_t = 4;
pub const DDS_ReturnCode_t_DDS_RETCODE_OUT_OF_RESOURCES: DDS_ReturnCode_t = 5;
pub const DDS_ReturnCode_t_DDS_RETCODE_NOT_ENABLED: DDS_ReturnCode_t = 6;
pub const DDS_ReturnCode_t_DDS_RETCODE_IMMUTABLE_POLICY: DDS_ReturnCode_t = 7;
pub const DDS_ReturnCode_t_DDS_RETCODE_INCONSISTENT: DDS_ReturnCode_t = 8;
pub const DDS_ReturnCode_t_DDS_RETCODE_ALREADY_DELETED: DDS_ReturnCode_t = 9;
pub const DDS_ReturnCode_t_DDS_RETCODE_TIMEOUT: DDS_ReturnCode_t = 10;
pub const DDS_ReturnCode_t_DDS_RETCODE_NO_DATA: DDS_ReturnCode_t = 11;
pub const DDS_ReturnCode_t_DDS_RETCODE_ILLEGAL_OPERATION: DDS_ReturnCode_t = 12;
pub const DDS_ReturnCode_t_DDS_RETCODE_NOT_ALLOWED_BY_SEC: DDS_ReturnCode_t = 13;
pub type DDS_ReturnCode_t = ::std::os::raw::c_int;
pub const DDS_SampleStateKind_DDS_READ_SAMPLE_STATE: DDS_SampleStateKind = 1;
pub const DDS_SampleStateKind_DDS_NOT_READ_SAMPLE_STATE: DDS_SampleStateKind = 2;
pub type DDS_SampleStateKind = ::std::os::raw::c_int;
pub const DDS_ViewStateKind_DDS_NEW_VIEW_STATE: DDS_ViewStateKind = 1;
pub const DDS_ViewStateKind_DDS_NOT_NEW_VIEW_STATE: DDS_ViewStateKind = 2;
pub type DDS_ViewStateKind = ::std::os::raw::c_int;
pub const DDS_InstanceStateKind_DDS_ALIVE_INSTANCE_STATE: DDS_InstanceStateKind = 1;
pub const DDS_InstanceStateKind_DDS_NOT_ALIVE_DISPOSED_INSTANCE_STATE: DDS_InstanceStateKind = 2;
pub const DDS_InstanceStateKind_DDS_NOT_ALIVE_NO_WRITERS_INSTANCE_STATE: DDS_InstanceStateKind = 4;
pub type DDS_InstanceStateKind = ::std::os::raw::c_int;
pub type ZR_BOOLEAN = ::std::os::raw::c_char;
pub type ZR_INT8 = ::std::os::raw::c_char;
pub type ZR_UINT8 = ::std::os::raw::c_uchar;
pub type ZR_INT16 = ::std::os::raw::c_short;
pub type ZR_UINT16 = ::std::os::raw::c_ushort;
pub type ZR_INT32 = ::std::os::raw::c_int;
pub type ZR_UINT32 = ::std::os::raw::c_uint;
pub type ZR_INT64 = ::std::os::raw::c_longlong;
pub type ZR_UINT64 = ::std::os::raw::c_ulonglong;
pub type ZR_FLOAT32 = f32;
pub type ZR_DOUBLE64 = f64;
pub type DDS_Boolean = ZR_BOOLEAN;
pub type DDS_Octet = ::std::os::raw::c_uchar;
pub type DDS_Char = ::std::os::raw::c_char;
pub type DDS_Short = ZR_INT16;
pub type DDS_UShort = ZR_UINT16;
pub type DDS_Long = ZR_INT32;
pub type DDS_ULong = ZR_UINT32;
pub type DDS_LongLong = ZR_INT64;
pub type DDS_ULongLong = ZR_UINT64;
pub type DDS_Float = ZR_FLOAT32;
pub type DDS_Double = ZR_DOUBLE64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ZRBuffer {
    pub content: *mut ::std::os::raw::c_void,
    pub length: ZR_UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ZRBuffer"][::std::mem::size_of::<ZRBuffer>() - 16usize];
    ["Alignment of ZRBuffer"][::std::mem::align_of::<ZRBuffer>() - 8usize];
    ["Offset of field: ZRBuffer::content"][::std::mem::offset_of!(ZRBuffer, content) - 0usize];
    ["Offset of field: ZRBuffer::length"][::std::mem::offset_of!(ZRBuffer, length) - 8usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DDS_DURATION_INFINITE_SEC: DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DDS_DURATION_ZERO_SEC: DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DDS_DURATION_INFINITE_NSEC: DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DDS_DURATION_ZERO_NSEC: DDS_ULong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_Duration_t {
    pub sec: DDS_Long,
    pub nanosec: DDS_ULong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_Duration_t"][::std::mem::size_of::<DDS_Duration_t>() - 8usize];
    ["Alignment of DDS_Duration_t"][::std::mem::align_of::<DDS_Duration_t>() - 4usize];
    ["Offset of field: DDS_Duration_t::sec"][::std::mem::offset_of!(DDS_Duration_t, sec) - 0usize];
    ["Offset of field: DDS_Duration_t::nanosec"]
        [::std::mem::offset_of!(DDS_Duration_t, nanosec) - 4usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DurationAdd(
        self_: *const DDS_Duration_t,
        right: *const DDS_Duration_t,
    ) -> DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DurationSub(
        self_: *const DDS_Duration_t,
        subtractor: *const DDS_Duration_t,
    ) -> DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DurationCompare(self_: *const DDS_Duration_t, right: *const DDS_Duration_t) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DurationGetMicrosec(self_: *const DDS_Duration_t) -> DDS_ULongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DurationGetMillisec(self_: *const DDS_Duration_t) -> DDS_ULongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DurationFromSec(seconds: DDS_ULong) -> DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DurationFromMillis(milliseconds: DDS_ULong) -> DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DurationFromMicros(microseconds: DDS_ULong) -> DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DurationFromNanos(nanoseconds: DDS_ULong) -> DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static INVALID_DURATION: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static INFINITE_DURATION: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static ZERO_DURATION: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DEFALUT_HB_RESP_DELAY: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DEFALUT_HB_SUPPRESSION: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static mut DEFALUT_MAX_BLOCKING_TIME: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DEFALUT_HB_PERIOD: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DEFALUT_NACK_RESP_DELAY: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DEFALUT_NACK_SUPPRESSION: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DEFALUT_UPDATE_PARTICIPANT: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DEFALUT_PARTICIPANT_LEASE: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DEFALUT_CHECK_PARTICIPANT_STALE: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DEFALUT_REFRESH_UNACK: DDS_Duration_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static mut DEFAULT_DATAP_SUPPRESSION: DDS_Duration_t;
}
pub type DDS_Time_t = DDS_Duration_t;
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DDS_TIME_ZERO: DDS_Time_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DDS_TIME_INVALID: DDS_Time_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DDS_TIME_INFINITE: DDS_Time_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ZRGetNowTime(nowTime: *mut DDS_Time_t);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ZRGetNowTimeString(strformat: *mut DDS_Char) -> DDS_LongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ZRGetNowTimeString2(strformat: *mut DDS_Char) -> DDS_LongLong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ZRMemPool {
    _unused: [u8; 0],
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ZRMalloc(pool: *mut ZRMemPool, size: DDS_ULong) -> *mut ::std::os::raw::c_void;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ZRDealloc(pool: *mut ZRMemPool, mem: *mut ::std::os::raw::c_void);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ZRInitialGlobalMemPool();
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ZRFinalizeGlobalMemPool();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_InstanceHandle_t {
    pub value: [DDS_Octet; 16usize],
    pub valid: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_InstanceHandle_t"][::std::mem::size_of::<DDS_InstanceHandle_t>() - 17usize];
    ["Alignment of DDS_InstanceHandle_t"][::std::mem::align_of::<DDS_InstanceHandle_t>() - 1usize];
    ["Offset of field: DDS_InstanceHandle_t::value"]
        [::std::mem::offset_of!(DDS_InstanceHandle_t, value) - 0usize];
    ["Offset of field: DDS_InstanceHandle_t::valid"]
        [::std::mem::offset_of!(DDS_InstanceHandle_t, valid) - 16usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandle_t_Compare(
        handle1: *const DDS_InstanceHandle_t,
        handle2: *const DDS_InstanceHandle_t,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static DDS_HANDLE_NIL_NATIVE: DDS_InstanceHandle_t;
}
pub type DDS_KeyHash_t = DDS_InstanceHandle_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_InstanceHandleSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_InstanceHandle_t,
    pub _discontiguousBuffer: *mut *mut DDS_InstanceHandle_t,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_InstanceHandleSeq"][::std::mem::size_of::<DDS_InstanceHandleSeq>() - 72usize];
    ["Alignment of DDS_InstanceHandleSeq"]
        [::std::mem::align_of::<DDS_InstanceHandleSeq>() - 8usize];
    ["Offset of field: DDS_InstanceHandleSeq::_owned"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _owned) - 0usize];
    ["Offset of field: DDS_InstanceHandleSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_InstanceHandleSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_InstanceHandleSeq::_maximum"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _maximum) - 24usize];
    ["Offset of field: DDS_InstanceHandleSeq::_length"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _length) - 28usize];
    ["Offset of field: DDS_InstanceHandleSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_InstanceHandleSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_InstanceHandleSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_InstanceHandleSeq::_mempool"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _mempool) - 56usize];
    ["Offset of field: DDS_InstanceHandleSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_InstanceHandleSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_is_initialized(self_: *const DDS_InstanceHandleSeq)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_set(
        self_: *mut DDS_InstanceHandleSeq,
        index: DDS_ULong,
        newValue: *const DDS_InstanceHandle_t,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_initialize(self_: *mut DDS_InstanceHandleSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_new(newMax: DDS_ULong) -> *mut DDS_InstanceHandleSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_get_maximum(self_: *const DDS_InstanceHandleSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_set_maximum(
        self_: *mut DDS_InstanceHandleSeq,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_get_length(self_: *const DDS_InstanceHandleSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_set_length(
        self_: *mut DDS_InstanceHandleSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_ensure_length(
        self_: *mut DDS_InstanceHandleSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_get_reference(
        self_: *const DDS_InstanceHandleSeq,
        index: DDS_ULong,
    ) -> *mut DDS_InstanceHandle_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_append(
        self_: *mut DDS_InstanceHandleSeq,
        newValue: *const DDS_InstanceHandle_t,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_append_autosize(
        self_: *mut DDS_InstanceHandleSeq,
        newValue: *const DDS_InstanceHandle_t,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_copy_no_alloc(
        self_: *mut DDS_InstanceHandleSeq,
        src: *const DDS_InstanceHandleSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_copy(
        self_: *mut DDS_InstanceHandleSeq,
        src: *const DDS_InstanceHandleSeq,
    ) -> *mut DDS_InstanceHandleSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_compare(
        self_: *const DDS_InstanceHandleSeq,
        src: *const DDS_InstanceHandleSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_from_array(
        self_: *mut DDS_InstanceHandleSeq,
        srcArray: *const DDS_InstanceHandle_t,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_to_array(
        self_: *const DDS_InstanceHandleSeq,
        dstArray: *mut DDS_InstanceHandle_t,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_loan_contiguous(
        self_: *mut DDS_InstanceHandleSeq,
        buffer: *mut DDS_InstanceHandle_t,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_loan_discontiguous(
        self_: *mut DDS_InstanceHandleSeq,
        buffer: *mut *mut DDS_InstanceHandle_t,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_unloan(self_: *mut DDS_InstanceHandleSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_get_contiguous_buffer(
        self_: *const DDS_InstanceHandleSeq,
    ) -> *mut DDS_InstanceHandle_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_get_discontiguous_buffer(
        self_: *const DDS_InstanceHandleSeq,
    ) -> *mut *mut DDS_InstanceHandle_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_get_reader_and_data_ptr(
        self_: *const DDS_InstanceHandleSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_set_reader_and_data_ptr(
        self_: *mut DDS_InstanceHandleSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_has_ownership(self_: *const DDS_InstanceHandleSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_clear(self_: *mut DDS_InstanceHandleSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_finalize(self_: *mut DDS_InstanceHandleSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_shallow_copy(
        self_: *mut DDS_InstanceHandleSeq,
        other: *mut DDS_InstanceHandleSeq,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_InstanceHandleSeq_initialize_ex(
        self_: *mut DDS_InstanceHandleSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_SequenceNumber_t {
    pub high: DDS_Long,
    pub low: DDS_ULong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_SequenceNumber_t"][::std::mem::size_of::<DDS_SequenceNumber_t>() - 8usize];
    ["Alignment of DDS_SequenceNumber_t"][::std::mem::align_of::<DDS_SequenceNumber_t>() - 4usize];
    ["Offset of field: DDS_SequenceNumber_t::high"]
        [::std::mem::offset_of!(DDS_SequenceNumber_t, high) - 0usize];
    ["Offset of field: DDS_SequenceNumber_t::low"]
        [::std::mem::offset_of!(DDS_SequenceNumber_t, low) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_SampleInfo {
    pub sample_state: DDS_SampleStateKind,
    pub view_state: DDS_ViewStateKind,
    pub instance_state: DDS_InstanceStateKind,
    pub source_timestamp: DDS_Time_t,
    pub write_sequence_number: DDS_SequenceNumber_t,
    pub instance_handle: DDS_InstanceHandle_t,
    pub publication_handle: DDS_InstanceHandle_t,
    pub disposed_generation_count: DDS_ULong,
    pub no_writers_generation_count: DDS_ULong,
    pub sample_rank: DDS_ULong,
    pub generation_rank: DDS_ULong,
    pub absolute_generation_rank: DDS_ULong,
    pub valid_data: DDS_Boolean,
    pub recive_locator: *mut ::std::os::raw::c_void,
    pub recive_order: DDS_ULong,
    pub is_batch_end: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_SampleInfo"][::std::mem::size_of::<DDS_SampleInfo>() - 104usize];
    ["Alignment of DDS_SampleInfo"][::std::mem::align_of::<DDS_SampleInfo>() - 8usize];
    ["Offset of field: DDS_SampleInfo::sample_state"]
        [::std::mem::offset_of!(DDS_SampleInfo, sample_state) - 0usize];
    ["Offset of field: DDS_SampleInfo::view_state"]
        [::std::mem::offset_of!(DDS_SampleInfo, view_state) - 4usize];
    ["Offset of field: DDS_SampleInfo::instance_state"]
        [::std::mem::offset_of!(DDS_SampleInfo, instance_state) - 8usize];
    ["Offset of field: DDS_SampleInfo::source_timestamp"]
        [::std::mem::offset_of!(DDS_SampleInfo, source_timestamp) - 12usize];
    ["Offset of field: DDS_SampleInfo::write_sequence_number"]
        [::std::mem::offset_of!(DDS_SampleInfo, write_sequence_number) - 20usize];
    ["Offset of field: DDS_SampleInfo::instance_handle"]
        [::std::mem::offset_of!(DDS_SampleInfo, instance_handle) - 28usize];
    ["Offset of field: DDS_SampleInfo::publication_handle"]
        [::std::mem::offset_of!(DDS_SampleInfo, publication_handle) - 45usize];
    ["Offset of field: DDS_SampleInfo::disposed_generation_count"]
        [::std::mem::offset_of!(DDS_SampleInfo, disposed_generation_count) - 64usize];
    ["Offset of field: DDS_SampleInfo::no_writers_generation_count"]
        [::std::mem::offset_of!(DDS_SampleInfo, no_writers_generation_count) - 68usize];
    ["Offset of field: DDS_SampleInfo::sample_rank"]
        [::std::mem::offset_of!(DDS_SampleInfo, sample_rank) - 72usize];
    ["Offset of field: DDS_SampleInfo::generation_rank"]
        [::std::mem::offset_of!(DDS_SampleInfo, generation_rank) - 76usize];
    ["Offset of field: DDS_SampleInfo::absolute_generation_rank"]
        [::std::mem::offset_of!(DDS_SampleInfo, absolute_generation_rank) - 80usize];
    ["Offset of field: DDS_SampleInfo::valid_data"]
        [::std::mem::offset_of!(DDS_SampleInfo, valid_data) - 84usize];
    ["Offset of field: DDS_SampleInfo::recive_locator"]
        [::std::mem::offset_of!(DDS_SampleInfo, recive_locator) - 88usize];
    ["Offset of field: DDS_SampleInfo::recive_order"]
        [::std::mem::offset_of!(DDS_SampleInfo, recive_order) - 96usize];
    ["Offset of field: DDS_SampleInfo::is_batch_end"]
        [::std::mem::offset_of!(DDS_SampleInfo, is_batch_end) - 100usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_SampleInfoValidMember {
    pub source_timestamp: DDS_Boolean,
    pub valid_data: DDS_Boolean,
    pub instance_handle: DDS_Boolean,
    pub instance_state: DDS_Boolean,
    pub sample_state: DDS_Boolean,
    pub view_state: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_SampleInfoValidMember"]
        [::std::mem::size_of::<DDS_SampleInfoValidMember>() - 6usize];
    ["Alignment of DDS_SampleInfoValidMember"]
        [::std::mem::align_of::<DDS_SampleInfoValidMember>() - 1usize];
    ["Offset of field: DDS_SampleInfoValidMember::source_timestamp"]
        [::std::mem::offset_of!(DDS_SampleInfoValidMember, source_timestamp) - 0usize];
    ["Offset of field: DDS_SampleInfoValidMember::valid_data"]
        [::std::mem::offset_of!(DDS_SampleInfoValidMember, valid_data) - 1usize];
    ["Offset of field: DDS_SampleInfoValidMember::instance_handle"]
        [::std::mem::offset_of!(DDS_SampleInfoValidMember, instance_handle) - 2usize];
    ["Offset of field: DDS_SampleInfoValidMember::instance_state"]
        [::std::mem::offset_of!(DDS_SampleInfoValidMember, instance_state) - 3usize];
    ["Offset of field: DDS_SampleInfoValidMember::sample_state"]
        [::std::mem::offset_of!(DDS_SampleInfoValidMember, sample_state) - 4usize];
    ["Offset of field: DDS_SampleInfoValidMember::view_state"]
        [::std::mem::offset_of!(DDS_SampleInfoValidMember, view_state) - 5usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_SampleInfoSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_SampleInfo,
    pub _discontiguousBuffer: *mut *mut DDS_SampleInfo,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_SampleInfoSeq"][::std::mem::size_of::<DDS_SampleInfoSeq>() - 72usize];
    ["Alignment of DDS_SampleInfoSeq"][::std::mem::align_of::<DDS_SampleInfoSeq>() - 8usize];
    ["Offset of field: DDS_SampleInfoSeq::_owned"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _owned) - 0usize];
    ["Offset of field: DDS_SampleInfoSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_SampleInfoSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_SampleInfoSeq::_maximum"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _maximum) - 24usize];
    ["Offset of field: DDS_SampleInfoSeq::_length"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _length) - 28usize];
    ["Offset of field: DDS_SampleInfoSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_SampleInfoSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_SampleInfoSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_SampleInfoSeq::_mempool"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _mempool) - 56usize];
    ["Offset of field: DDS_SampleInfoSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_SampleInfoSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_is_initialized(self_: *const DDS_SampleInfoSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_set(
        self_: *mut DDS_SampleInfoSeq,
        index: DDS_ULong,
        newValue: *const DDS_SampleInfo,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_initialize(self_: *mut DDS_SampleInfoSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_new(newMax: DDS_ULong) -> *mut DDS_SampleInfoSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_get_maximum(self_: *const DDS_SampleInfoSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_set_maximum(
        self_: *mut DDS_SampleInfoSeq,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_get_length(self_: *const DDS_SampleInfoSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_set_length(
        self_: *mut DDS_SampleInfoSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_ensure_length(
        self_: *mut DDS_SampleInfoSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_get_reference(
        self_: *const DDS_SampleInfoSeq,
        index: DDS_ULong,
    ) -> *mut DDS_SampleInfo;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_append(
        self_: *mut DDS_SampleInfoSeq,
        newValue: *const DDS_SampleInfo,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_append_autosize(
        self_: *mut DDS_SampleInfoSeq,
        newValue: *const DDS_SampleInfo,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_copy_no_alloc(
        self_: *mut DDS_SampleInfoSeq,
        src: *const DDS_SampleInfoSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_copy(
        self_: *mut DDS_SampleInfoSeq,
        src: *const DDS_SampleInfoSeq,
    ) -> *mut DDS_SampleInfoSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_compare(
        self_: *const DDS_SampleInfoSeq,
        src: *const DDS_SampleInfoSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_from_array(
        self_: *mut DDS_SampleInfoSeq,
        srcArray: *const DDS_SampleInfo,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_to_array(
        self_: *const DDS_SampleInfoSeq,
        dstArray: *mut DDS_SampleInfo,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_loan_contiguous(
        self_: *mut DDS_SampleInfoSeq,
        buffer: *mut DDS_SampleInfo,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_loan_discontiguous(
        self_: *mut DDS_SampleInfoSeq,
        buffer: *mut *mut DDS_SampleInfo,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_unloan(self_: *mut DDS_SampleInfoSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_get_contiguous_buffer(
        self_: *const DDS_SampleInfoSeq,
    ) -> *mut DDS_SampleInfo;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_get_discontiguous_buffer(
        self_: *const DDS_SampleInfoSeq,
    ) -> *mut *mut DDS_SampleInfo;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_get_reader_and_data_ptr(
        self_: *const DDS_SampleInfoSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_set_reader_and_data_ptr(
        self_: *mut DDS_SampleInfoSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_has_ownership(self_: *const DDS_SampleInfoSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_clear(self_: *mut DDS_SampleInfoSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_finalize(self_: *mut DDS_SampleInfoSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_shallow_copy(
        self_: *mut DDS_SampleInfoSeq,
        other: *mut DDS_SampleInfoSeq,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_SampleInfoSeq_initialize_ex(
        self_: *mut DDS_SampleInfoSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
pub type DDS_SampleStateMask = DDS_ULong;
pub type DDS_ViewStateMask = DDS_ULong;
pub type DDS_InstanceStateMask = DDS_ULong;
pub type DDS_StatusKindMask = DDS_ULong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_LivelinessChangedStatus {
    pub alive_count: DDS_Long,
    pub not_alive_count: DDS_Long,
    pub alive_count_change: DDS_Long,
    pub not_alive_count_change: DDS_Long,
    pub last_publication_handle: DDS_InstanceHandle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_LivelinessChangedStatus"]
        [::std::mem::size_of::<DDS_LivelinessChangedStatus>() - 36usize];
    ["Alignment of DDS_LivelinessChangedStatus"]
        [::std::mem::align_of::<DDS_LivelinessChangedStatus>() - 4usize];
    ["Offset of field: DDS_LivelinessChangedStatus::alive_count"]
        [::std::mem::offset_of!(DDS_LivelinessChangedStatus, alive_count) - 0usize];
    ["Offset of field: DDS_LivelinessChangedStatus::not_alive_count"]
        [::std::mem::offset_of!(DDS_LivelinessChangedStatus, not_alive_count) - 4usize];
    ["Offset of field: DDS_LivelinessChangedStatus::alive_count_change"]
        [::std::mem::offset_of!(DDS_LivelinessChangedStatus, alive_count_change) - 8usize];
    ["Offset of field: DDS_LivelinessChangedStatus::not_alive_count_change"]
        [::std::mem::offset_of!(DDS_LivelinessChangedStatus, not_alive_count_change) - 12usize];
    ["Offset of field: DDS_LivelinessChangedStatus::last_publication_handle"]
        [::std::mem::offset_of!(DDS_LivelinessChangedStatus, last_publication_handle) - 16usize];
};
pub const DDS_QosPolicyId_t_DDS_INVALID_QOS_POLICY_ID: DDS_QosPolicyId_t = 0;
pub const DDS_QosPolicyId_t_DDS_USERDATA_QOS_POLICY_ID: DDS_QosPolicyId_t = 1;
pub const DDS_QosPolicyId_t_DDS_DURABILITY_QOS_POLICY_ID: DDS_QosPolicyId_t = 2;
pub const DDS_QosPolicyId_t_DDS_PRESENTATION_QOS_POLICY_ID: DDS_QosPolicyId_t = 3;
pub const DDS_QosPolicyId_t_DDS_DEADLINE_QOS_POLICY_ID: DDS_QosPolicyId_t = 4;
pub const DDS_QosPolicyId_t_DDS_LATENCYBUDGET_QOS_POLICY_ID: DDS_QosPolicyId_t = 5;
pub const DDS_QosPolicyId_t_DDS_OWNERSHIP_QOS_POLICY_ID: DDS_QosPolicyId_t = 6;
pub const DDS_QosPolicyId_t_DDS_OWNERSHIPSTRENGTH_QOS_POLICY_ID: DDS_QosPolicyId_t = 7;
pub const DDS_QosPolicyId_t_DDS_LIVELINESS_QOS_POLICY_ID: DDS_QosPolicyId_t = 8;
pub const DDS_QosPolicyId_t_DDS_TIMEBASEDFILTER_QOS_POLICY_ID: DDS_QosPolicyId_t = 9;
pub const DDS_QosPolicyId_t_DDS_PARTITION_QOS_POLICY_ID: DDS_QosPolicyId_t = 10;
pub const DDS_QosPolicyId_t_DDS_RELIABILITY_QOS_POLICY_ID: DDS_QosPolicyId_t = 11;
pub const DDS_QosPolicyId_t_DDS_DESTINATIONORDER_QOS_POLICY_ID: DDS_QosPolicyId_t = 12;
pub const DDS_QosPolicyId_t_DDS_HISTORY_QOS_POLICY_ID: DDS_QosPolicyId_t = 13;
pub const DDS_QosPolicyId_t_DDS_RESOURCELIMITS_QOS_POLICY_ID: DDS_QosPolicyId_t = 14;
pub const DDS_QosPolicyId_t_DDS_ENTITYFACTORY_QOS_POLICY_ID: DDS_QosPolicyId_t = 15;
pub const DDS_QosPolicyId_t_DDS_WRITERDATALIFECYCLE_QOS_POLICY_ID: DDS_QosPolicyId_t = 16;
pub const DDS_QosPolicyId_t_DDS_READERDATALIFECYCLE_QOS_POLICY_ID: DDS_QosPolicyId_t = 17;
pub const DDS_QosPolicyId_t_DDS_TOPICDATA_QOS_POLICY_ID: DDS_QosPolicyId_t = 18;
pub const DDS_QosPolicyId_t_DDS_GROUPDATA_QOS_POLICY_ID: DDS_QosPolicyId_t = 19;
pub const DDS_QosPolicyId_t_DDS_TRANSPORTPRIORITY_QOS_POLICY_ID: DDS_QosPolicyId_t = 20;
pub const DDS_QosPolicyId_t_DDS_LIFESPAN_QOS_POLICY_ID: DDS_QosPolicyId_t = 21;
pub const DDS_QosPolicyId_t_DDS_DURABILITYSERVICE_QOS_POLICY_ID: DDS_QosPolicyId_t = 22;
pub const DDS_QosPolicyId_t_DDS_DATA_REPRESENTATION_QOS_POLICY_ID: DDS_QosPolicyId_t = 23;
pub const DDS_QosPolicyId_t_DDS_TYPE_CONSISTENCY_ENFORCEMENT_QOS_POLICY_ID: DDS_QosPolicyId_t = 24;
pub const DDS_QosPolicyId_t_DDS_NETWORKCONFIG_QOS_POLICY_ID: DDS_QosPolicyId_t = 50;
pub const DDS_QosPolicyId_t_DDS_DISCOVERYCONFIG_QOS_POLICY_ID: DDS_QosPolicyId_t = 51;
pub type DDS_QosPolicyId_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_QosPolicyCount {
    pub last_policy_id: DDS_QosPolicyId_t,
    pub count: DDS_Long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_QosPolicyCount"][::std::mem::size_of::<DDS_QosPolicyCount>() - 8usize];
    ["Alignment of DDS_QosPolicyCount"][::std::mem::align_of::<DDS_QosPolicyCount>() - 4usize];
    ["Offset of field: DDS_QosPolicyCount::last_policy_id"]
        [::std::mem::offset_of!(DDS_QosPolicyCount, last_policy_id) - 0usize];
    ["Offset of field: DDS_QosPolicyCount::count"]
        [::std::mem::offset_of!(DDS_QosPolicyCount, count) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_QosPolicyCountSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_QosPolicyCount,
    pub _discontiguousBuffer: *mut *mut DDS_QosPolicyCount,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_QosPolicyCountSeq"][::std::mem::size_of::<DDS_QosPolicyCountSeq>() - 72usize];
    ["Alignment of DDS_QosPolicyCountSeq"]
        [::std::mem::align_of::<DDS_QosPolicyCountSeq>() - 8usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_owned"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _owned) - 0usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_maximum"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _maximum) - 24usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_length"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _length) - 28usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_mempool"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _mempool) - 56usize];
    ["Offset of field: DDS_QosPolicyCountSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_QosPolicyCountSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_is_initialized(self_: *const DDS_QosPolicyCountSeq)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_set(
        self_: *mut DDS_QosPolicyCountSeq,
        index: DDS_ULong,
        newValue: *const DDS_QosPolicyCount,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_initialize(self_: *mut DDS_QosPolicyCountSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_new(newMax: DDS_ULong) -> *mut DDS_QosPolicyCountSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_get_maximum(self_: *const DDS_QosPolicyCountSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_set_maximum(
        self_: *mut DDS_QosPolicyCountSeq,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_get_length(self_: *const DDS_QosPolicyCountSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_set_length(
        self_: *mut DDS_QosPolicyCountSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_ensure_length(
        self_: *mut DDS_QosPolicyCountSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_get_reference(
        self_: *const DDS_QosPolicyCountSeq,
        index: DDS_ULong,
    ) -> *mut DDS_QosPolicyCount;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_append(
        self_: *mut DDS_QosPolicyCountSeq,
        newValue: *const DDS_QosPolicyCount,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_append_autosize(
        self_: *mut DDS_QosPolicyCountSeq,
        newValue: *const DDS_QosPolicyCount,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_copy_no_alloc(
        self_: *mut DDS_QosPolicyCountSeq,
        src: *const DDS_QosPolicyCountSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_copy(
        self_: *mut DDS_QosPolicyCountSeq,
        src: *const DDS_QosPolicyCountSeq,
    ) -> *mut DDS_QosPolicyCountSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_compare(
        self_: *const DDS_QosPolicyCountSeq,
        src: *const DDS_QosPolicyCountSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_from_array(
        self_: *mut DDS_QosPolicyCountSeq,
        srcArray: *const DDS_QosPolicyCount,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_to_array(
        self_: *const DDS_QosPolicyCountSeq,
        dstArray: *mut DDS_QosPolicyCount,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_loan_contiguous(
        self_: *mut DDS_QosPolicyCountSeq,
        buffer: *mut DDS_QosPolicyCount,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_loan_discontiguous(
        self_: *mut DDS_QosPolicyCountSeq,
        buffer: *mut *mut DDS_QosPolicyCount,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_unloan(self_: *mut DDS_QosPolicyCountSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_get_contiguous_buffer(
        self_: *const DDS_QosPolicyCountSeq,
    ) -> *mut DDS_QosPolicyCount;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_get_discontiguous_buffer(
        self_: *const DDS_QosPolicyCountSeq,
    ) -> *mut *mut DDS_QosPolicyCount;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_get_reader_and_data_ptr(
        self_: *const DDS_QosPolicyCountSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_set_reader_and_data_ptr(
        self_: *mut DDS_QosPolicyCountSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_has_ownership(self_: *const DDS_QosPolicyCountSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_clear(self_: *mut DDS_QosPolicyCountSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_finalize(self_: *mut DDS_QosPolicyCountSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_shallow_copy(
        self_: *mut DDS_QosPolicyCountSeq,
        other: *mut DDS_QosPolicyCountSeq,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_QosPolicyCountSeq_initialize_ex(
        self_: *mut DDS_QosPolicyCountSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_RequestedIncompatibleQosStatus {
    pub total_count: DDS_Long,
    pub total_count_change: DDS_Long,
    pub last_policy_id: DDS_QosPolicyId_t,
    pub policies: DDS_QosPolicyCountSeq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_RequestedIncompatibleQosStatus"]
        [::std::mem::size_of::<DDS_RequestedIncompatibleQosStatus>() - 88usize];
    ["Alignment of DDS_RequestedIncompatibleQosStatus"]
        [::std::mem::align_of::<DDS_RequestedIncompatibleQosStatus>() - 8usize];
    ["Offset of field: DDS_RequestedIncompatibleQosStatus::total_count"]
        [::std::mem::offset_of!(DDS_RequestedIncompatibleQosStatus, total_count) - 0usize];
    ["Offset of field: DDS_RequestedIncompatibleQosStatus::total_count_change"]
        [::std::mem::offset_of!(DDS_RequestedIncompatibleQosStatus, total_count_change) - 4usize];
    ["Offset of field: DDS_RequestedIncompatibleQosStatus::last_policy_id"]
        [::std::mem::offset_of!(DDS_RequestedIncompatibleQosStatus, last_policy_id) - 8usize];
    ["Offset of field: DDS_RequestedIncompatibleQosStatus::policies"]
        [::std::mem::offset_of!(DDS_RequestedIncompatibleQosStatus, policies) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_RequestedDeadlineMissedStatus {
    pub total_count: DDS_Long,
    pub total_count_change: DDS_Long,
    pub last_instance_handle: DDS_InstanceHandle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_RequestedDeadlineMissedStatus"]
        [::std::mem::size_of::<DDS_RequestedDeadlineMissedStatus>() - 28usize];
    ["Alignment of DDS_RequestedDeadlineMissedStatus"]
        [::std::mem::align_of::<DDS_RequestedDeadlineMissedStatus>() - 4usize];
    ["Offset of field: DDS_RequestedDeadlineMissedStatus::total_count"]
        [::std::mem::offset_of!(DDS_RequestedDeadlineMissedStatus, total_count) - 0usize];
    ["Offset of field: DDS_RequestedDeadlineMissedStatus::total_count_change"]
        [::std::mem::offset_of!(DDS_RequestedDeadlineMissedStatus, total_count_change) - 4usize];
    ["Offset of field: DDS_RequestedDeadlineMissedStatus::last_instance_handle"]
        [::std::mem::offset_of!(DDS_RequestedDeadlineMissedStatus, last_instance_handle) - 8usize];
};
pub type DDS_BuiltinTopicKey_t = [DDS_ULong; 4usize];
pub const DDS_DurabilityQosPolicyKind_DDS_VOLATILE_DURABILITY_QOS: DDS_DurabilityQosPolicyKind = 0;
pub const DDS_DurabilityQosPolicyKind_DDS_TRANSIENT_LOCAL_DURABILITY_QOS:
    DDS_DurabilityQosPolicyKind = 1;
pub const DDS_DurabilityQosPolicyKind_DDS_TRANSIENT_DURABILITY_QOS: DDS_DurabilityQosPolicyKind = 2;
pub const DDS_DurabilityQosPolicyKind_DDS_PERSISTENT_DURABILITY_QOS: DDS_DurabilityQosPolicyKind =
    3;
pub type DDS_DurabilityQosPolicyKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_DurabilityQosPolicy {
    pub kind: DDS_DurabilityQosPolicyKind,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_DurabilityQosPolicy"][::std::mem::size_of::<DDS_DurabilityQosPolicy>() - 4usize];
    ["Alignment of DDS_DurabilityQosPolicy"]
        [::std::mem::align_of::<DDS_DurabilityQosPolicy>() - 4usize];
    ["Offset of field: DDS_DurabilityQosPolicy::kind"]
        [::std::mem::offset_of!(DDS_DurabilityQosPolicy, kind) - 0usize];
};
pub const DDS_HistoryQosPolicyKind_DDS_KEEP_LAST_HISTORY_QOS: DDS_HistoryQosPolicyKind = 0;
pub const DDS_HistoryQosPolicyKind_DDS_KEEP_ALL_HISTORY_QOS: DDS_HistoryQosPolicyKind = 1;
pub type DDS_HistoryQosPolicyKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_HistoryQosPolicy {
    pub kind: DDS_HistoryQosPolicyKind,
    pub depth: DDS_Long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_HistoryQosPolicy"][::std::mem::size_of::<DDS_HistoryQosPolicy>() - 8usize];
    ["Alignment of DDS_HistoryQosPolicy"][::std::mem::align_of::<DDS_HistoryQosPolicy>() - 4usize];
    ["Offset of field: DDS_HistoryQosPolicy::kind"]
        [::std::mem::offset_of!(DDS_HistoryQosPolicy, kind) - 0usize];
    ["Offset of field: DDS_HistoryQosPolicy::depth"]
        [::std::mem::offset_of!(DDS_HistoryQosPolicy, depth) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_DurabilityServiceQosPolicy {
    pub service_cleanup_delay: DDS_Duration_t,
    pub history_kind: DDS_HistoryQosPolicyKind,
    pub history_depth: DDS_Long,
    pub max_samples: DDS_Long,
    pub max_instances: DDS_Long,
    pub max_samples_per_instance: DDS_Long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_DurabilityServiceQosPolicy"]
        [::std::mem::size_of::<DDS_DurabilityServiceQosPolicy>() - 28usize];
    ["Alignment of DDS_DurabilityServiceQosPolicy"]
        [::std::mem::align_of::<DDS_DurabilityServiceQosPolicy>() - 4usize];
    ["Offset of field: DDS_DurabilityServiceQosPolicy::service_cleanup_delay"]
        [::std::mem::offset_of!(DDS_DurabilityServiceQosPolicy, service_cleanup_delay) - 0usize];
    ["Offset of field: DDS_DurabilityServiceQosPolicy::history_kind"]
        [::std::mem::offset_of!(DDS_DurabilityServiceQosPolicy, history_kind) - 8usize];
    ["Offset of field: DDS_DurabilityServiceQosPolicy::history_depth"]
        [::std::mem::offset_of!(DDS_DurabilityServiceQosPolicy, history_depth) - 12usize];
    ["Offset of field: DDS_DurabilityServiceQosPolicy::max_samples"]
        [::std::mem::offset_of!(DDS_DurabilityServiceQosPolicy, max_samples) - 16usize];
    ["Offset of field: DDS_DurabilityServiceQosPolicy::max_instances"]
        [::std::mem::offset_of!(DDS_DurabilityServiceQosPolicy, max_instances) - 20usize];
    ["Offset of field: DDS_DurabilityServiceQosPolicy::max_samples_per_instance"][::std::mem::offset_of!(
        DDS_DurabilityServiceQosPolicy,
        max_samples_per_instance
    ) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_DeadlineQosPolicy {
    pub period: DDS_Duration_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_DeadlineQosPolicy"][::std::mem::size_of::<DDS_DeadlineQosPolicy>() - 8usize];
    ["Alignment of DDS_DeadlineQosPolicy"]
        [::std::mem::align_of::<DDS_DeadlineQosPolicy>() - 4usize];
    ["Offset of field: DDS_DeadlineQosPolicy::period"]
        [::std::mem::offset_of!(DDS_DeadlineQosPolicy, period) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_LatencyBudgetQosPolicy {
    pub duration: DDS_Duration_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_LatencyBudgetQosPolicy"]
        [::std::mem::size_of::<DDS_LatencyBudgetQosPolicy>() - 8usize];
    ["Alignment of DDS_LatencyBudgetQosPolicy"]
        [::std::mem::align_of::<DDS_LatencyBudgetQosPolicy>() - 4usize];
    ["Offset of field: DDS_LatencyBudgetQosPolicy::duration"]
        [::std::mem::offset_of!(DDS_LatencyBudgetQosPolicy, duration) - 0usize];
};
pub const DDS_LivelinessQosPolicyKind_DDS_AUTOMATIC_LIVELINESS_QOS: DDS_LivelinessQosPolicyKind = 0;
pub const DDS_LivelinessQosPolicyKind_DDS_MANUAL_BY_PARTICIPANT_LIVELINESS_QOS:
    DDS_LivelinessQosPolicyKind = 1;
pub const DDS_LivelinessQosPolicyKind_DDS_MANUAL_BY_TOPIC_LIVELINESS_QOS:
    DDS_LivelinessQosPolicyKind = 2;
pub type DDS_LivelinessQosPolicyKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_LivelinessQosPolicy {
    pub kind: DDS_LivelinessQosPolicyKind,
    pub lease_duration: DDS_Duration_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_LivelinessQosPolicy"][::std::mem::size_of::<DDS_LivelinessQosPolicy>() - 12usize];
    ["Alignment of DDS_LivelinessQosPolicy"]
        [::std::mem::align_of::<DDS_LivelinessQosPolicy>() - 4usize];
    ["Offset of field: DDS_LivelinessQosPolicy::kind"]
        [::std::mem::offset_of!(DDS_LivelinessQosPolicy, kind) - 0usize];
    ["Offset of field: DDS_LivelinessQosPolicy::lease_duration"]
        [::std::mem::offset_of!(DDS_LivelinessQosPolicy, lease_duration) - 4usize];
};
pub const DDS_ReliabilityQosPolicyKind_DDS_BEST_EFFORT_RELIABILITY_QOS:
    DDS_ReliabilityQosPolicyKind = 1;
pub const DDS_ReliabilityQosPolicyKind_DDS_RELIABLE_RELIABILITY_QOS: DDS_ReliabilityQosPolicyKind =
    2;
pub type DDS_ReliabilityQosPolicyKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_ReliabilityQosPolicy {
    pub kind: DDS_ReliabilityQosPolicyKind,
    pub max_blocking_time: DDS_Duration_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_ReliabilityQosPolicy"]
        [::std::mem::size_of::<DDS_ReliabilityQosPolicy>() - 12usize];
    ["Alignment of DDS_ReliabilityQosPolicy"]
        [::std::mem::align_of::<DDS_ReliabilityQosPolicy>() - 4usize];
    ["Offset of field: DDS_ReliabilityQosPolicy::kind"]
        [::std::mem::offset_of!(DDS_ReliabilityQosPolicy, kind) - 0usize];
    ["Offset of field: DDS_ReliabilityQosPolicy::max_blocking_time"]
        [::std::mem::offset_of!(DDS_ReliabilityQosPolicy, max_blocking_time) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_LifespanQosPolicy {
    pub duration: DDS_Duration_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_LifespanQosPolicy"][::std::mem::size_of::<DDS_LifespanQosPolicy>() - 8usize];
    ["Alignment of DDS_LifespanQosPolicy"]
        [::std::mem::align_of::<DDS_LifespanQosPolicy>() - 4usize];
    ["Offset of field: DDS_LifespanQosPolicy::duration"]
        [::std::mem::offset_of!(DDS_LifespanQosPolicy, duration) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct MessageBlock {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CDRSerializer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CDRDeserializer {
    _unused: [u8; 0],
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerInitialWBuf(
        buffer: *mut ZR_INT8,
        length: ZR_UINT32,
        littleEndian: ZR_BOOLEAN,
    ) -> *mut CDRSerializer;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerInitialWBuf(
        buffer: *mut ZR_INT8,
        length: ZR_UINT32,
        littleEndian: ZR_BOOLEAN,
    ) -> *mut CDRDeserializer;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerGetBufferSpace(self_: *mut CDRSerializer) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerGetBufferLength(self_: *mut CDRDeserializer) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerDestoryBuffer(self_: *mut CDRSerializer);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerDestoryBuffer(self_: *mut CDRDeserializer);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerInitial(
        self_: *mut CDRSerializer,
        tgaMsgBlock: *mut MessageBlock,
        littleEndian: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerPutString(
        self_: *mut CDRSerializer,
        value: *const ZR_INT8,
        length: ZR_UINT32,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerPutUntype(
        self_: *mut CDRSerializer,
        val: *const ZR_UINT8,
        typeSize: ZR_UINT32,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerGetUntypeSize(
        typeSize: ZR_UINT32,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerGetUntypeArraySize(
        typeSize: ZR_UINT32,
        arraySize: ZR_UINT32,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerGetStringSize(length: ZR_UINT32, currentAlignment: ZR_UINT32) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerPutUntypeArray(
        self_: *mut CDRSerializer,
        arrayVal: *const ZR_UINT8,
        arraySize: ZR_UINT32,
        typeSize: ZR_UINT32,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerNoSerializingMode(self_: *mut CDRSerializer) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerSetNoSerializingMode(
        self_: *mut CDRSerializer,
        noSerializingMode: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerIsLittleEndian(self_: *mut CDRSerializer) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerInitial(
        self_: *mut CDRDeserializer,
        srcMsg: *mut MessageBlock,
        useLittleEndian: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerGetString(
        self_: *mut CDRDeserializer,
        value: *mut ZR_INT8,
        length: *mut ZR_UINT32,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerGetUntype(
        self_: *mut CDRDeserializer,
        value: *mut ZR_UINT8,
        typeSize: ZR_UINT32,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerLoanContiguousByte(
        self_: *mut CDRDeserializer,
        length: ZR_UINT32,
    ) -> *mut ZR_INT8;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerGetUntypeArray(
        self_: *mut CDRDeserializer,
        value: *mut ZR_UINT8,
        arraySize: ZR_UINT32,
        typeSize: ZR_UINT32,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerAheadLength(
        self_: *mut CDRDeserializer,
        beginIndex: ZR_UINT32,
        length: ZR_UINT32,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerIsLittleEndian(self_: *mut CDRDeserializer) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ParameterHeaderSerialize(
        cdr: *mut CDRSerializer,
        useExtended: ZR_BOOLEAN,
        mustUnderstand: ZR_BOOLEAN,
        memberId: ZR_UINT32,
    ) -> *mut ZR_INT8;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ParameterLenSerialize(
        cdr: *mut CDRSerializer,
        lenAddr: *mut ZR_INT8,
        length: ZR_UINT32,
        lengthSize: ZR_UINT16,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ParameterHeaderDeserialize(
        cdr: *mut CDRDeserializer,
        memberId: *mut ZR_UINT32,
        length: *mut ZR_UINT32,
        useExtend: *mut ZR_BOOLEAN,
        mustUnderstand: *mut ZR_BOOLEAN,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializeGetKeyHash(
        cdr: *mut CDRSerializer,
        keyHash: *mut ZR_UINT8,
        needMd5: ZR_BOOLEAN,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerPushState(cdr: *mut CDRDeserializer);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRDeserializerPopState(cdr: *mut CDRDeserializer);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn CDRSerializerAheadWrPtr(self_: *mut CDRSerializer, length: ZR_UINT32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TypeCodeHeader {
    _unused: [u8; 0],
}
pub const TCTypeKind_DDS_TK_NULL: TCTypeKind = 0;
pub const TCTypeKind_DDS_TK_SHORT: TCTypeKind = 1;
pub const TCTypeKind_DDS_TK_INT: TCTypeKind = 2;
pub const TCTypeKind_DDS_TK_USHORT: TCTypeKind = 3;
pub const TCTypeKind_DDS_TK_UINT: TCTypeKind = 4;
pub const TCTypeKind_DDS_TK_FLOAT: TCTypeKind = 5;
pub const TCTypeKind_DDS_TK_DOUBLE: TCTypeKind = 6;
pub const TCTypeKind_DDS_TK_BOOLEAN: TCTypeKind = 7;
pub const TCTypeKind_DDS_TK_CHAR: TCTypeKind = 8;
pub const TCTypeKind_DDS_TK_UCHAR: TCTypeKind = 9;
pub const TCTypeKind_DDS_TK_STRUCT: TCTypeKind = 10;
pub const TCTypeKind_DDS_TK_UNION: TCTypeKind = 11;
pub const TCTypeKind_DDS_TK_ENUM: TCTypeKind = 12;
pub const TCTypeKind_DDS_TK_STRING: TCTypeKind = 13;
pub const TCTypeKind_DDS_TK_SEQUENCE: TCTypeKind = 14;
pub const TCTypeKind_DDS_TK_ARRAY: TCTypeKind = 15;
pub const TCTypeKind_DDS_TK_ALIAS: TCTypeKind = 16;
pub const TCTypeKind_DDS_TK_LONGLONG: TCTypeKind = 17;
pub const TCTypeKind_DDS_TK_ULONGLONG: TCTypeKind = 18;
pub const TCTypeKind_DDS_TK_VALUETYPE: TCTypeKind = 22;
pub const TCTypeKind_DDS_TK_UNKNOWN: TCTypeKind = -1;
pub type TCTypeKind = ::std::os::raw::c_int;
pub const TypeCodeExceptionCode_TC_EC_OK: TypeCodeExceptionCode = 0;
pub const TypeCodeExceptionCode_TC_EC_ERROR: TypeCodeExceptionCode = 1;
pub type TypeCodeExceptionCode = ::std::os::raw::c_int;
pub const TypeCodeModifierKind_DDS_MODIFIER_NONE: TypeCodeModifierKind = 0;
pub type TypeCodeModifierKind = ::std::os::raw::c_int;
pub const ExtensibilityKind_DDS_EXTENSIBLE_EXTENSIBILITY: ExtensibilityKind = 0;
pub const ExtensibilityKind_DDS_FINAL_EXTENSIBILITY: ExtensibilityKind = 1;
pub const ExtensibilityKind_DDS_MUTABLE_EXTENSIBILITY: ExtensibilityKind = 2;
pub type ExtensibilityKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_BooleanSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_Boolean,
    pub _discontiguousBuffer: *mut *mut DDS_Boolean,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_BooleanSeq"][::std::mem::size_of::<DDS_BooleanSeq>() - 72usize];
    ["Alignment of DDS_BooleanSeq"][::std::mem::align_of::<DDS_BooleanSeq>() - 8usize];
    ["Offset of field: DDS_BooleanSeq::_owned"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _owned) - 0usize];
    ["Offset of field: DDS_BooleanSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_BooleanSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_BooleanSeq::_maximum"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _maximum) - 24usize];
    ["Offset of field: DDS_BooleanSeq::_length"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _length) - 28usize];
    ["Offset of field: DDS_BooleanSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_BooleanSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_BooleanSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_BooleanSeq::_mempool"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _mempool) - 56usize];
    ["Offset of field: DDS_BooleanSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_BooleanSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_is_initialized(self_: *const DDS_BooleanSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_set(
        self_: *mut DDS_BooleanSeq,
        index: DDS_ULong,
        newValue: *const DDS_Boolean,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_initialize(self_: *mut DDS_BooleanSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_new(newMax: DDS_ULong) -> *mut DDS_BooleanSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_get_maximum(self_: *const DDS_BooleanSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_set_maximum(self_: *mut DDS_BooleanSeq, newMax: DDS_ULong)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_get_length(self_: *const DDS_BooleanSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_set_length(
        self_: *mut DDS_BooleanSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_ensure_length(
        self_: *mut DDS_BooleanSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_get_reference(
        self_: *const DDS_BooleanSeq,
        index: DDS_ULong,
    ) -> *mut DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_append(
        self_: *mut DDS_BooleanSeq,
        newValue: *const DDS_Boolean,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_append_autosize(
        self_: *mut DDS_BooleanSeq,
        newValue: *const DDS_Boolean,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_copy_no_alloc(
        self_: *mut DDS_BooleanSeq,
        src: *const DDS_BooleanSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_copy(
        self_: *mut DDS_BooleanSeq,
        src: *const DDS_BooleanSeq,
    ) -> *mut DDS_BooleanSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_compare(
        self_: *const DDS_BooleanSeq,
        src: *const DDS_BooleanSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_from_array(
        self_: *mut DDS_BooleanSeq,
        srcArray: *const DDS_Boolean,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_to_array(
        self_: *const DDS_BooleanSeq,
        dstArray: *mut DDS_Boolean,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_loan_contiguous(
        self_: *mut DDS_BooleanSeq,
        buffer: *mut DDS_Boolean,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_loan_discontiguous(
        self_: *mut DDS_BooleanSeq,
        buffer: *mut *mut DDS_Boolean,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_unloan(self_: *mut DDS_BooleanSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_get_contiguous_buffer(self_: *const DDS_BooleanSeq) -> *mut DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_get_discontiguous_buffer(
        self_: *const DDS_BooleanSeq,
    ) -> *mut *mut DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_get_reader_and_data_ptr(
        self_: *const DDS_BooleanSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_set_reader_and_data_ptr(
        self_: *mut DDS_BooleanSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_has_ownership(self_: *const DDS_BooleanSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_clear(self_: *mut DDS_BooleanSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_finalize(self_: *mut DDS_BooleanSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_shallow_copy(self_: *mut DDS_BooleanSeq, other: *mut DDS_BooleanSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSeq_initialize_ex(
        self_: *mut DDS_BooleanSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_OctetSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_Octet,
    pub _discontiguousBuffer: *mut *mut DDS_Octet,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_OctetSeq"][::std::mem::size_of::<DDS_OctetSeq>() - 72usize];
    ["Alignment of DDS_OctetSeq"][::std::mem::align_of::<DDS_OctetSeq>() - 8usize];
    ["Offset of field: DDS_OctetSeq::_owned"]
        [::std::mem::offset_of!(DDS_OctetSeq, _owned) - 0usize];
    ["Offset of field: DDS_OctetSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_OctetSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_OctetSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_OctetSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_OctetSeq::_maximum"]
        [::std::mem::offset_of!(DDS_OctetSeq, _maximum) - 24usize];
    ["Offset of field: DDS_OctetSeq::_length"]
        [::std::mem::offset_of!(DDS_OctetSeq, _length) - 28usize];
    ["Offset of field: DDS_OctetSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_OctetSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_OctetSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_OctetSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_OctetSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_OctetSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_OctetSeq::_mempool"]
        [::std::mem::offset_of!(DDS_OctetSeq, _mempool) - 56usize];
    ["Offset of field: DDS_OctetSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_OctetSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_is_initialized(self_: *const DDS_OctetSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_set(
        self_: *mut DDS_OctetSeq,
        index: DDS_ULong,
        newValue: *const DDS_Octet,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_initialize(self_: *mut DDS_OctetSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_new(newMax: DDS_ULong) -> *mut DDS_OctetSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_get_maximum(self_: *const DDS_OctetSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_set_maximum(self_: *mut DDS_OctetSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_get_length(self_: *const DDS_OctetSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_set_length(self_: *mut DDS_OctetSeq, newLength: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_ensure_length(
        self_: *mut DDS_OctetSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_get_reference(
        self_: *const DDS_OctetSeq,
        index: DDS_ULong,
    ) -> *mut DDS_Octet;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_append(self_: *mut DDS_OctetSeq, newValue: *const DDS_Octet)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_append_autosize(
        self_: *mut DDS_OctetSeq,
        newValue: *const DDS_Octet,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_copy_no_alloc(
        self_: *mut DDS_OctetSeq,
        src: *const DDS_OctetSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_copy(
        self_: *mut DDS_OctetSeq,
        src: *const DDS_OctetSeq,
    ) -> *mut DDS_OctetSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_compare(self_: *const DDS_OctetSeq, src: *const DDS_OctetSeq) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_from_array(
        self_: *mut DDS_OctetSeq,
        srcArray: *const DDS_Octet,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_to_array(
        self_: *const DDS_OctetSeq,
        dstArray: *mut DDS_Octet,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_loan_contiguous(
        self_: *mut DDS_OctetSeq,
        buffer: *mut DDS_Octet,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_loan_discontiguous(
        self_: *mut DDS_OctetSeq,
        buffer: *mut *mut DDS_Octet,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_unloan(self_: *mut DDS_OctetSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_get_contiguous_buffer(self_: *const DDS_OctetSeq) -> *mut DDS_Octet;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_get_discontiguous_buffer(self_: *const DDS_OctetSeq)
    -> *mut *mut DDS_Octet;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_get_reader_and_data_ptr(
        self_: *const DDS_OctetSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_set_reader_and_data_ptr(
        self_: *mut DDS_OctetSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_has_ownership(self_: *const DDS_OctetSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_clear(self_: *mut DDS_OctetSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_finalize(self_: *mut DDS_OctetSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_shallow_copy(self_: *mut DDS_OctetSeq, other: *mut DDS_OctetSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSeq_initialize_ex(
        self_: *mut DDS_OctetSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_CharSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_Char,
    pub _discontiguousBuffer: *mut *mut DDS_Char,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_CharSeq"][::std::mem::size_of::<DDS_CharSeq>() - 72usize];
    ["Alignment of DDS_CharSeq"][::std::mem::align_of::<DDS_CharSeq>() - 8usize];
    ["Offset of field: DDS_CharSeq::_owned"][::std::mem::offset_of!(DDS_CharSeq, _owned) - 0usize];
    ["Offset of field: DDS_CharSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_CharSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_CharSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_CharSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_CharSeq::_maximum"]
        [::std::mem::offset_of!(DDS_CharSeq, _maximum) - 24usize];
    ["Offset of field: DDS_CharSeq::_length"]
        [::std::mem::offset_of!(DDS_CharSeq, _length) - 28usize];
    ["Offset of field: DDS_CharSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_CharSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_CharSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_CharSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_CharSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_CharSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_CharSeq::_mempool"]
        [::std::mem::offset_of!(DDS_CharSeq, _mempool) - 56usize];
    ["Offset of field: DDS_CharSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_CharSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_is_initialized(self_: *const DDS_CharSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_set(
        self_: *mut DDS_CharSeq,
        index: DDS_ULong,
        newValue: *const DDS_Char,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_initialize(self_: *mut DDS_CharSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_new(newMax: DDS_ULong) -> *mut DDS_CharSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_get_maximum(self_: *const DDS_CharSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_set_maximum(self_: *mut DDS_CharSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_get_length(self_: *const DDS_CharSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_set_length(self_: *mut DDS_CharSeq, newLength: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_ensure_length(
        self_: *mut DDS_CharSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_get_reference(self_: *const DDS_CharSeq, index: DDS_ULong) -> *mut DDS_Char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_append(self_: *mut DDS_CharSeq, newValue: *const DDS_Char) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_append_autosize(
        self_: *mut DDS_CharSeq,
        newValue: *const DDS_Char,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_copy_no_alloc(
        self_: *mut DDS_CharSeq,
        src: *const DDS_CharSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_copy(self_: *mut DDS_CharSeq, src: *const DDS_CharSeq) -> *mut DDS_CharSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_compare(self_: *const DDS_CharSeq, src: *const DDS_CharSeq) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_from_array(
        self_: *mut DDS_CharSeq,
        srcArray: *const DDS_Char,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_to_array(
        self_: *const DDS_CharSeq,
        dstArray: *mut DDS_Char,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_loan_contiguous(
        self_: *mut DDS_CharSeq,
        buffer: *mut DDS_Char,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_loan_discontiguous(
        self_: *mut DDS_CharSeq,
        buffer: *mut *mut DDS_Char,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_unloan(self_: *mut DDS_CharSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_get_contiguous_buffer(self_: *const DDS_CharSeq) -> *mut DDS_Char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_get_discontiguous_buffer(self_: *const DDS_CharSeq) -> *mut *mut DDS_Char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_get_reader_and_data_ptr(
        self_: *const DDS_CharSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_set_reader_and_data_ptr(
        self_: *mut DDS_CharSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_has_ownership(self_: *const DDS_CharSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_clear(self_: *mut DDS_CharSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_finalize(self_: *mut DDS_CharSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_shallow_copy(self_: *mut DDS_CharSeq, other: *mut DDS_CharSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSeq_initialize_ex(
        self_: *mut DDS_CharSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_ShortSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_Short,
    pub _discontiguousBuffer: *mut *mut DDS_Short,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_ShortSeq"][::std::mem::size_of::<DDS_ShortSeq>() - 72usize];
    ["Alignment of DDS_ShortSeq"][::std::mem::align_of::<DDS_ShortSeq>() - 8usize];
    ["Offset of field: DDS_ShortSeq::_owned"]
        [::std::mem::offset_of!(DDS_ShortSeq, _owned) - 0usize];
    ["Offset of field: DDS_ShortSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_ShortSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_ShortSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_ShortSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_ShortSeq::_maximum"]
        [::std::mem::offset_of!(DDS_ShortSeq, _maximum) - 24usize];
    ["Offset of field: DDS_ShortSeq::_length"]
        [::std::mem::offset_of!(DDS_ShortSeq, _length) - 28usize];
    ["Offset of field: DDS_ShortSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_ShortSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_ShortSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_ShortSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_ShortSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_ShortSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_ShortSeq::_mempool"]
        [::std::mem::offset_of!(DDS_ShortSeq, _mempool) - 56usize];
    ["Offset of field: DDS_ShortSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_ShortSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_is_initialized(self_: *const DDS_ShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_set(
        self_: *mut DDS_ShortSeq,
        index: DDS_ULong,
        newValue: *const DDS_Short,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_initialize(self_: *mut DDS_ShortSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_new(newMax: DDS_ULong) -> *mut DDS_ShortSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_get_maximum(self_: *const DDS_ShortSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_set_maximum(self_: *mut DDS_ShortSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_get_length(self_: *const DDS_ShortSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_set_length(self_: *mut DDS_ShortSeq, newLength: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_ensure_length(
        self_: *mut DDS_ShortSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_get_reference(
        self_: *const DDS_ShortSeq,
        index: DDS_ULong,
    ) -> *mut DDS_Short;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_append(self_: *mut DDS_ShortSeq, newValue: *const DDS_Short)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_append_autosize(
        self_: *mut DDS_ShortSeq,
        newValue: *const DDS_Short,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_copy_no_alloc(
        self_: *mut DDS_ShortSeq,
        src: *const DDS_ShortSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_copy(
        self_: *mut DDS_ShortSeq,
        src: *const DDS_ShortSeq,
    ) -> *mut DDS_ShortSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_compare(self_: *const DDS_ShortSeq, src: *const DDS_ShortSeq) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_from_array(
        self_: *mut DDS_ShortSeq,
        srcArray: *const DDS_Short,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_to_array(
        self_: *const DDS_ShortSeq,
        dstArray: *mut DDS_Short,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_loan_contiguous(
        self_: *mut DDS_ShortSeq,
        buffer: *mut DDS_Short,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_loan_discontiguous(
        self_: *mut DDS_ShortSeq,
        buffer: *mut *mut DDS_Short,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_unloan(self_: *mut DDS_ShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_get_contiguous_buffer(self_: *const DDS_ShortSeq) -> *mut DDS_Short;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_get_discontiguous_buffer(self_: *const DDS_ShortSeq)
    -> *mut *mut DDS_Short;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_get_reader_and_data_ptr(
        self_: *const DDS_ShortSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_set_reader_and_data_ptr(
        self_: *mut DDS_ShortSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_has_ownership(self_: *const DDS_ShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_clear(self_: *mut DDS_ShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_finalize(self_: *mut DDS_ShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_shallow_copy(self_: *mut DDS_ShortSeq, other: *mut DDS_ShortSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSeq_initialize_ex(
        self_: *mut DDS_ShortSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_UShortSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_UShort,
    pub _discontiguousBuffer: *mut *mut DDS_UShort,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_UShortSeq"][::std::mem::size_of::<DDS_UShortSeq>() - 72usize];
    ["Alignment of DDS_UShortSeq"][::std::mem::align_of::<DDS_UShortSeq>() - 8usize];
    ["Offset of field: DDS_UShortSeq::_owned"]
        [::std::mem::offset_of!(DDS_UShortSeq, _owned) - 0usize];
    ["Offset of field: DDS_UShortSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_UShortSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_UShortSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_UShortSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_UShortSeq::_maximum"]
        [::std::mem::offset_of!(DDS_UShortSeq, _maximum) - 24usize];
    ["Offset of field: DDS_UShortSeq::_length"]
        [::std::mem::offset_of!(DDS_UShortSeq, _length) - 28usize];
    ["Offset of field: DDS_UShortSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_UShortSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_UShortSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_UShortSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_UShortSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_UShortSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_UShortSeq::_mempool"]
        [::std::mem::offset_of!(DDS_UShortSeq, _mempool) - 56usize];
    ["Offset of field: DDS_UShortSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_UShortSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_is_initialized(self_: *const DDS_UShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_set(
        self_: *mut DDS_UShortSeq,
        index: DDS_ULong,
        newValue: *const DDS_UShort,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_initialize(self_: *mut DDS_UShortSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_new(newMax: DDS_ULong) -> *mut DDS_UShortSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_get_maximum(self_: *const DDS_UShortSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_set_maximum(self_: *mut DDS_UShortSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_get_length(self_: *const DDS_UShortSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_set_length(self_: *mut DDS_UShortSeq, newLength: DDS_ULong)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_ensure_length(
        self_: *mut DDS_UShortSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_get_reference(
        self_: *const DDS_UShortSeq,
        index: DDS_ULong,
    ) -> *mut DDS_UShort;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_append(
        self_: *mut DDS_UShortSeq,
        newValue: *const DDS_UShort,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_append_autosize(
        self_: *mut DDS_UShortSeq,
        newValue: *const DDS_UShort,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_copy_no_alloc(
        self_: *mut DDS_UShortSeq,
        src: *const DDS_UShortSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_copy(
        self_: *mut DDS_UShortSeq,
        src: *const DDS_UShortSeq,
    ) -> *mut DDS_UShortSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_compare(
        self_: *const DDS_UShortSeq,
        src: *const DDS_UShortSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_from_array(
        self_: *mut DDS_UShortSeq,
        srcArray: *const DDS_UShort,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_to_array(
        self_: *const DDS_UShortSeq,
        dstArray: *mut DDS_UShort,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_loan_contiguous(
        self_: *mut DDS_UShortSeq,
        buffer: *mut DDS_UShort,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_loan_discontiguous(
        self_: *mut DDS_UShortSeq,
        buffer: *mut *mut DDS_UShort,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_unloan(self_: *mut DDS_UShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_get_contiguous_buffer(self_: *const DDS_UShortSeq) -> *mut DDS_UShort;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_get_discontiguous_buffer(
        self_: *const DDS_UShortSeq,
    ) -> *mut *mut DDS_UShort;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_get_reader_and_data_ptr(
        self_: *const DDS_UShortSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_set_reader_and_data_ptr(
        self_: *mut DDS_UShortSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_has_ownership(self_: *const DDS_UShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_clear(self_: *mut DDS_UShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_finalize(self_: *mut DDS_UShortSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_shallow_copy(self_: *mut DDS_UShortSeq, other: *mut DDS_UShortSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSeq_initialize_ex(
        self_: *mut DDS_UShortSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_LongSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_Long,
    pub _discontiguousBuffer: *mut *mut DDS_Long,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_LongSeq"][::std::mem::size_of::<DDS_LongSeq>() - 72usize];
    ["Alignment of DDS_LongSeq"][::std::mem::align_of::<DDS_LongSeq>() - 8usize];
    ["Offset of field: DDS_LongSeq::_owned"][::std::mem::offset_of!(DDS_LongSeq, _owned) - 0usize];
    ["Offset of field: DDS_LongSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_LongSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_LongSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_LongSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_LongSeq::_maximum"]
        [::std::mem::offset_of!(DDS_LongSeq, _maximum) - 24usize];
    ["Offset of field: DDS_LongSeq::_length"]
        [::std::mem::offset_of!(DDS_LongSeq, _length) - 28usize];
    ["Offset of field: DDS_LongSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_LongSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_LongSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_LongSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_LongSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_LongSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_LongSeq::_mempool"]
        [::std::mem::offset_of!(DDS_LongSeq, _mempool) - 56usize];
    ["Offset of field: DDS_LongSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_LongSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_is_initialized(self_: *const DDS_LongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_set(
        self_: *mut DDS_LongSeq,
        index: DDS_ULong,
        newValue: *const DDS_Long,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_initialize(self_: *mut DDS_LongSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_new(newMax: DDS_ULong) -> *mut DDS_LongSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_get_maximum(self_: *const DDS_LongSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_set_maximum(self_: *mut DDS_LongSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_get_length(self_: *const DDS_LongSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_set_length(self_: *mut DDS_LongSeq, newLength: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_ensure_length(
        self_: *mut DDS_LongSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_get_reference(self_: *const DDS_LongSeq, index: DDS_ULong) -> *mut DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_append(self_: *mut DDS_LongSeq, newValue: *const DDS_Long) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_append_autosize(
        self_: *mut DDS_LongSeq,
        newValue: *const DDS_Long,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_copy_no_alloc(
        self_: *mut DDS_LongSeq,
        src: *const DDS_LongSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_copy(self_: *mut DDS_LongSeq, src: *const DDS_LongSeq) -> *mut DDS_LongSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_compare(self_: *const DDS_LongSeq, src: *const DDS_LongSeq) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_from_array(
        self_: *mut DDS_LongSeq,
        srcArray: *const DDS_Long,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_to_array(
        self_: *const DDS_LongSeq,
        dstArray: *mut DDS_Long,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_loan_contiguous(
        self_: *mut DDS_LongSeq,
        buffer: *mut DDS_Long,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_loan_discontiguous(
        self_: *mut DDS_LongSeq,
        buffer: *mut *mut DDS_Long,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_unloan(self_: *mut DDS_LongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_get_contiguous_buffer(self_: *const DDS_LongSeq) -> *mut DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_get_discontiguous_buffer(self_: *const DDS_LongSeq) -> *mut *mut DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_get_reader_and_data_ptr(
        self_: *const DDS_LongSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_set_reader_and_data_ptr(
        self_: *mut DDS_LongSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_has_ownership(self_: *const DDS_LongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_clear(self_: *mut DDS_LongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_finalize(self_: *mut DDS_LongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_shallow_copy(self_: *mut DDS_LongSeq, other: *mut DDS_LongSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSeq_initialize_ex(
        self_: *mut DDS_LongSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_ULongSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_ULong,
    pub _discontiguousBuffer: *mut *mut DDS_ULong,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_ULongSeq"][::std::mem::size_of::<DDS_ULongSeq>() - 72usize];
    ["Alignment of DDS_ULongSeq"][::std::mem::align_of::<DDS_ULongSeq>() - 8usize];
    ["Offset of field: DDS_ULongSeq::_owned"]
        [::std::mem::offset_of!(DDS_ULongSeq, _owned) - 0usize];
    ["Offset of field: DDS_ULongSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_ULongSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_ULongSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_ULongSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_ULongSeq::_maximum"]
        [::std::mem::offset_of!(DDS_ULongSeq, _maximum) - 24usize];
    ["Offset of field: DDS_ULongSeq::_length"]
        [::std::mem::offset_of!(DDS_ULongSeq, _length) - 28usize];
    ["Offset of field: DDS_ULongSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_ULongSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_ULongSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_ULongSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_ULongSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_ULongSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_ULongSeq::_mempool"]
        [::std::mem::offset_of!(DDS_ULongSeq, _mempool) - 56usize];
    ["Offset of field: DDS_ULongSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_ULongSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_is_initialized(self_: *const DDS_ULongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_set(
        self_: *mut DDS_ULongSeq,
        index: DDS_ULong,
        newValue: *const DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_initialize(self_: *mut DDS_ULongSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_new(newMax: DDS_ULong) -> *mut DDS_ULongSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_get_maximum(self_: *const DDS_ULongSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_set_maximum(self_: *mut DDS_ULongSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_get_length(self_: *const DDS_ULongSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_set_length(self_: *mut DDS_ULongSeq, newLength: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_ensure_length(
        self_: *mut DDS_ULongSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_get_reference(
        self_: *const DDS_ULongSeq,
        index: DDS_ULong,
    ) -> *mut DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_append(self_: *mut DDS_ULongSeq, newValue: *const DDS_ULong)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_append_autosize(
        self_: *mut DDS_ULongSeq,
        newValue: *const DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_copy_no_alloc(
        self_: *mut DDS_ULongSeq,
        src: *const DDS_ULongSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_copy(
        self_: *mut DDS_ULongSeq,
        src: *const DDS_ULongSeq,
    ) -> *mut DDS_ULongSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_compare(self_: *const DDS_ULongSeq, src: *const DDS_ULongSeq) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_from_array(
        self_: *mut DDS_ULongSeq,
        srcArray: *const DDS_ULong,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_to_array(
        self_: *const DDS_ULongSeq,
        dstArray: *mut DDS_ULong,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_loan_contiguous(
        self_: *mut DDS_ULongSeq,
        buffer: *mut DDS_ULong,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_loan_discontiguous(
        self_: *mut DDS_ULongSeq,
        buffer: *mut *mut DDS_ULong,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_unloan(self_: *mut DDS_ULongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_get_contiguous_buffer(self_: *const DDS_ULongSeq) -> *mut DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_get_discontiguous_buffer(self_: *const DDS_ULongSeq)
    -> *mut *mut DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_get_reader_and_data_ptr(
        self_: *const DDS_ULongSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_set_reader_and_data_ptr(
        self_: *mut DDS_ULongSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_has_ownership(self_: *const DDS_ULongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_clear(self_: *mut DDS_ULongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_finalize(self_: *mut DDS_ULongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_shallow_copy(self_: *mut DDS_ULongSeq, other: *mut DDS_ULongSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSeq_initialize_ex(
        self_: *mut DDS_ULongSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_LongLongSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_LongLong,
    pub _discontiguousBuffer: *mut *mut DDS_LongLong,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_LongLongSeq"][::std::mem::size_of::<DDS_LongLongSeq>() - 72usize];
    ["Alignment of DDS_LongLongSeq"][::std::mem::align_of::<DDS_LongLongSeq>() - 8usize];
    ["Offset of field: DDS_LongLongSeq::_owned"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _owned) - 0usize];
    ["Offset of field: DDS_LongLongSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_LongLongSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_LongLongSeq::_maximum"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _maximum) - 24usize];
    ["Offset of field: DDS_LongLongSeq::_length"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _length) - 28usize];
    ["Offset of field: DDS_LongLongSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_LongLongSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_LongLongSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_LongLongSeq::_mempool"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _mempool) - 56usize];
    ["Offset of field: DDS_LongLongSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_LongLongSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_is_initialized(self_: *const DDS_LongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_set(
        self_: *mut DDS_LongLongSeq,
        index: DDS_ULong,
        newValue: *const DDS_LongLong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_initialize(self_: *mut DDS_LongLongSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_new(newMax: DDS_ULong) -> *mut DDS_LongLongSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_get_maximum(self_: *const DDS_LongLongSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_set_maximum(
        self_: *mut DDS_LongLongSeq,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_get_length(self_: *const DDS_LongLongSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_set_length(
        self_: *mut DDS_LongLongSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_ensure_length(
        self_: *mut DDS_LongLongSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_get_reference(
        self_: *const DDS_LongLongSeq,
        index: DDS_ULong,
    ) -> *mut DDS_LongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_append(
        self_: *mut DDS_LongLongSeq,
        newValue: *const DDS_LongLong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_append_autosize(
        self_: *mut DDS_LongLongSeq,
        newValue: *const DDS_LongLong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_copy_no_alloc(
        self_: *mut DDS_LongLongSeq,
        src: *const DDS_LongLongSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_copy(
        self_: *mut DDS_LongLongSeq,
        src: *const DDS_LongLongSeq,
    ) -> *mut DDS_LongLongSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_compare(
        self_: *const DDS_LongLongSeq,
        src: *const DDS_LongLongSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_from_array(
        self_: *mut DDS_LongLongSeq,
        srcArray: *const DDS_LongLong,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_to_array(
        self_: *const DDS_LongLongSeq,
        dstArray: *mut DDS_LongLong,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_loan_contiguous(
        self_: *mut DDS_LongLongSeq,
        buffer: *mut DDS_LongLong,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_loan_discontiguous(
        self_: *mut DDS_LongLongSeq,
        buffer: *mut *mut DDS_LongLong,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_unloan(self_: *mut DDS_LongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_get_contiguous_buffer(
        self_: *const DDS_LongLongSeq,
    ) -> *mut DDS_LongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_get_discontiguous_buffer(
        self_: *const DDS_LongLongSeq,
    ) -> *mut *mut DDS_LongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_get_reader_and_data_ptr(
        self_: *const DDS_LongLongSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_set_reader_and_data_ptr(
        self_: *mut DDS_LongLongSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_has_ownership(self_: *const DDS_LongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_clear(self_: *mut DDS_LongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_finalize(self_: *mut DDS_LongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_shallow_copy(self_: *mut DDS_LongLongSeq, other: *mut DDS_LongLongSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSeq_initialize_ex(
        self_: *mut DDS_LongLongSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_ULongLongSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_ULongLong,
    pub _discontiguousBuffer: *mut *mut DDS_ULongLong,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_ULongLongSeq"][::std::mem::size_of::<DDS_ULongLongSeq>() - 72usize];
    ["Alignment of DDS_ULongLongSeq"][::std::mem::align_of::<DDS_ULongLongSeq>() - 8usize];
    ["Offset of field: DDS_ULongLongSeq::_owned"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _owned) - 0usize];
    ["Offset of field: DDS_ULongLongSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_ULongLongSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_ULongLongSeq::_maximum"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _maximum) - 24usize];
    ["Offset of field: DDS_ULongLongSeq::_length"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _length) - 28usize];
    ["Offset of field: DDS_ULongLongSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_ULongLongSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_ULongLongSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_ULongLongSeq::_mempool"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _mempool) - 56usize];
    ["Offset of field: DDS_ULongLongSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_ULongLongSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_is_initialized(self_: *const DDS_ULongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_set(
        self_: *mut DDS_ULongLongSeq,
        index: DDS_ULong,
        newValue: *const DDS_ULongLong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_initialize(self_: *mut DDS_ULongLongSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_new(newMax: DDS_ULong) -> *mut DDS_ULongLongSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_get_maximum(self_: *const DDS_ULongLongSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_set_maximum(
        self_: *mut DDS_ULongLongSeq,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_get_length(self_: *const DDS_ULongLongSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_set_length(
        self_: *mut DDS_ULongLongSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_ensure_length(
        self_: *mut DDS_ULongLongSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_get_reference(
        self_: *const DDS_ULongLongSeq,
        index: DDS_ULong,
    ) -> *mut DDS_ULongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_append(
        self_: *mut DDS_ULongLongSeq,
        newValue: *const DDS_ULongLong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_append_autosize(
        self_: *mut DDS_ULongLongSeq,
        newValue: *const DDS_ULongLong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_copy_no_alloc(
        self_: *mut DDS_ULongLongSeq,
        src: *const DDS_ULongLongSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_copy(
        self_: *mut DDS_ULongLongSeq,
        src: *const DDS_ULongLongSeq,
    ) -> *mut DDS_ULongLongSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_compare(
        self_: *const DDS_ULongLongSeq,
        src: *const DDS_ULongLongSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_from_array(
        self_: *mut DDS_ULongLongSeq,
        srcArray: *const DDS_ULongLong,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_to_array(
        self_: *const DDS_ULongLongSeq,
        dstArray: *mut DDS_ULongLong,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_loan_contiguous(
        self_: *mut DDS_ULongLongSeq,
        buffer: *mut DDS_ULongLong,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_loan_discontiguous(
        self_: *mut DDS_ULongLongSeq,
        buffer: *mut *mut DDS_ULongLong,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_unloan(self_: *mut DDS_ULongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_get_contiguous_buffer(
        self_: *const DDS_ULongLongSeq,
    ) -> *mut DDS_ULongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_get_discontiguous_buffer(
        self_: *const DDS_ULongLongSeq,
    ) -> *mut *mut DDS_ULongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_get_reader_and_data_ptr(
        self_: *const DDS_ULongLongSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_set_reader_and_data_ptr(
        self_: *mut DDS_ULongLongSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_has_ownership(self_: *const DDS_ULongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_clear(self_: *mut DDS_ULongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_finalize(self_: *mut DDS_ULongLongSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_shallow_copy(
        self_: *mut DDS_ULongLongSeq,
        other: *mut DDS_ULongLongSeq,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSeq_initialize_ex(
        self_: *mut DDS_ULongLongSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_FloatSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_Float,
    pub _discontiguousBuffer: *mut *mut DDS_Float,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_FloatSeq"][::std::mem::size_of::<DDS_FloatSeq>() - 72usize];
    ["Alignment of DDS_FloatSeq"][::std::mem::align_of::<DDS_FloatSeq>() - 8usize];
    ["Offset of field: DDS_FloatSeq::_owned"]
        [::std::mem::offset_of!(DDS_FloatSeq, _owned) - 0usize];
    ["Offset of field: DDS_FloatSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_FloatSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_FloatSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_FloatSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_FloatSeq::_maximum"]
        [::std::mem::offset_of!(DDS_FloatSeq, _maximum) - 24usize];
    ["Offset of field: DDS_FloatSeq::_length"]
        [::std::mem::offset_of!(DDS_FloatSeq, _length) - 28usize];
    ["Offset of field: DDS_FloatSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_FloatSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_FloatSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_FloatSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_FloatSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_FloatSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_FloatSeq::_mempool"]
        [::std::mem::offset_of!(DDS_FloatSeq, _mempool) - 56usize];
    ["Offset of field: DDS_FloatSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_FloatSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_is_initialized(self_: *const DDS_FloatSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_set(
        self_: *mut DDS_FloatSeq,
        index: DDS_ULong,
        newValue: *const DDS_Float,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_initialize(self_: *mut DDS_FloatSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_new(newMax: DDS_ULong) -> *mut DDS_FloatSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_get_maximum(self_: *const DDS_FloatSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_set_maximum(self_: *mut DDS_FloatSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_get_length(self_: *const DDS_FloatSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_set_length(self_: *mut DDS_FloatSeq, newLength: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_ensure_length(
        self_: *mut DDS_FloatSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_get_reference(
        self_: *const DDS_FloatSeq,
        index: DDS_ULong,
    ) -> *mut DDS_Float;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_append(self_: *mut DDS_FloatSeq, newValue: *const DDS_Float)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_append_autosize(
        self_: *mut DDS_FloatSeq,
        newValue: *const DDS_Float,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_copy_no_alloc(
        self_: *mut DDS_FloatSeq,
        src: *const DDS_FloatSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_copy(
        self_: *mut DDS_FloatSeq,
        src: *const DDS_FloatSeq,
    ) -> *mut DDS_FloatSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_compare(self_: *const DDS_FloatSeq, src: *const DDS_FloatSeq) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_from_array(
        self_: *mut DDS_FloatSeq,
        srcArray: *const DDS_Float,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_to_array(
        self_: *const DDS_FloatSeq,
        dstArray: *mut DDS_Float,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_loan_contiguous(
        self_: *mut DDS_FloatSeq,
        buffer: *mut DDS_Float,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_loan_discontiguous(
        self_: *mut DDS_FloatSeq,
        buffer: *mut *mut DDS_Float,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_unloan(self_: *mut DDS_FloatSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_get_contiguous_buffer(self_: *const DDS_FloatSeq) -> *mut DDS_Float;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_get_discontiguous_buffer(self_: *const DDS_FloatSeq)
    -> *mut *mut DDS_Float;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_get_reader_and_data_ptr(
        self_: *const DDS_FloatSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_set_reader_and_data_ptr(
        self_: *mut DDS_FloatSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_has_ownership(self_: *const DDS_FloatSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_clear(self_: *mut DDS_FloatSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_finalize(self_: *mut DDS_FloatSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_shallow_copy(self_: *mut DDS_FloatSeq, other: *mut DDS_FloatSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSeq_initialize_ex(
        self_: *mut DDS_FloatSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_DoubleSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_Double,
    pub _discontiguousBuffer: *mut *mut DDS_Double,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_DoubleSeq"][::std::mem::size_of::<DDS_DoubleSeq>() - 72usize];
    ["Alignment of DDS_DoubleSeq"][::std::mem::align_of::<DDS_DoubleSeq>() - 8usize];
    ["Offset of field: DDS_DoubleSeq::_owned"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _owned) - 0usize];
    ["Offset of field: DDS_DoubleSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_DoubleSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_DoubleSeq::_maximum"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _maximum) - 24usize];
    ["Offset of field: DDS_DoubleSeq::_length"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _length) - 28usize];
    ["Offset of field: DDS_DoubleSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_DoubleSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_DoubleSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_DoubleSeq::_mempool"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _mempool) - 56usize];
    ["Offset of field: DDS_DoubleSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_DoubleSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_is_initialized(self_: *const DDS_DoubleSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_set(
        self_: *mut DDS_DoubleSeq,
        index: DDS_ULong,
        newValue: *const DDS_Double,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_initialize(self_: *mut DDS_DoubleSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_new(newMax: DDS_ULong) -> *mut DDS_DoubleSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_get_maximum(self_: *const DDS_DoubleSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_set_maximum(self_: *mut DDS_DoubleSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_get_length(self_: *const DDS_DoubleSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_set_length(self_: *mut DDS_DoubleSeq, newLength: DDS_ULong)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_ensure_length(
        self_: *mut DDS_DoubleSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_get_reference(
        self_: *const DDS_DoubleSeq,
        index: DDS_ULong,
    ) -> *mut DDS_Double;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_append(
        self_: *mut DDS_DoubleSeq,
        newValue: *const DDS_Double,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_append_autosize(
        self_: *mut DDS_DoubleSeq,
        newValue: *const DDS_Double,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_copy_no_alloc(
        self_: *mut DDS_DoubleSeq,
        src: *const DDS_DoubleSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_copy(
        self_: *mut DDS_DoubleSeq,
        src: *const DDS_DoubleSeq,
    ) -> *mut DDS_DoubleSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_compare(
        self_: *const DDS_DoubleSeq,
        src: *const DDS_DoubleSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_from_array(
        self_: *mut DDS_DoubleSeq,
        srcArray: *const DDS_Double,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_to_array(
        self_: *const DDS_DoubleSeq,
        dstArray: *mut DDS_Double,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_loan_contiguous(
        self_: *mut DDS_DoubleSeq,
        buffer: *mut DDS_Double,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_loan_discontiguous(
        self_: *mut DDS_DoubleSeq,
        buffer: *mut *mut DDS_Double,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_unloan(self_: *mut DDS_DoubleSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_get_contiguous_buffer(self_: *const DDS_DoubleSeq) -> *mut DDS_Double;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_get_discontiguous_buffer(
        self_: *const DDS_DoubleSeq,
    ) -> *mut *mut DDS_Double;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_get_reader_and_data_ptr(
        self_: *const DDS_DoubleSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_set_reader_and_data_ptr(
        self_: *mut DDS_DoubleSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_has_ownership(self_: *const DDS_DoubleSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_clear(self_: *mut DDS_DoubleSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_finalize(self_: *mut DDS_DoubleSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_shallow_copy(self_: *mut DDS_DoubleSeq, other: *mut DDS_DoubleSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSeq_initialize_ex(
        self_: *mut DDS_DoubleSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
pub type DDS_String = *mut DDS_Char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_StringSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut *mut DDS_Char,
    pub _discontiguousBuffer: *mut *mut *mut DDS_Char,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_StringSeq"][::std::mem::size_of::<DDS_StringSeq>() - 72usize];
    ["Alignment of DDS_StringSeq"][::std::mem::align_of::<DDS_StringSeq>() - 8usize];
    ["Offset of field: DDS_StringSeq::_owned"]
        [::std::mem::offset_of!(DDS_StringSeq, _owned) - 0usize];
    ["Offset of field: DDS_StringSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_StringSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_StringSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_StringSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_StringSeq::_maximum"]
        [::std::mem::offset_of!(DDS_StringSeq, _maximum) - 24usize];
    ["Offset of field: DDS_StringSeq::_length"]
        [::std::mem::offset_of!(DDS_StringSeq, _length) - 28usize];
    ["Offset of field: DDS_StringSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_StringSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_StringSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_StringSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_StringSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_StringSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_StringSeq::_mempool"]
        [::std::mem::offset_of!(DDS_StringSeq, _mempool) - 56usize];
    ["Offset of field: DDS_StringSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_StringSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_is_initialized(self_: *const DDS_StringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_set(
        self_: *mut DDS_StringSeq,
        index: DDS_ULong,
        newValue: *mut *const DDS_Char,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_initialize(self_: *mut DDS_StringSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_new(newMax: DDS_ULong) -> *mut DDS_StringSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_get_maximum(self_: *const DDS_StringSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_set_maximum(self_: *mut DDS_StringSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_get_length(self_: *const DDS_StringSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_set_length(self_: *mut DDS_StringSeq, newLength: DDS_ULong)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_ensure_length(
        self_: *mut DDS_StringSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_get_reference(
        self_: *const DDS_StringSeq,
        index: DDS_ULong,
    ) -> *mut *mut DDS_Char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_append(
        self_: *mut DDS_StringSeq,
        newValue: *mut *const DDS_Char,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_append_autosize(
        self_: *mut DDS_StringSeq,
        newValue: *mut *const DDS_Char,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_copy_no_alloc(
        self_: *mut DDS_StringSeq,
        src: *const DDS_StringSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_copy(
        self_: *mut DDS_StringSeq,
        src: *const DDS_StringSeq,
    ) -> *mut DDS_StringSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_compare(
        self_: *const DDS_StringSeq,
        src: *const DDS_StringSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_from_array(
        self_: *mut DDS_StringSeq,
        srcArray: *mut *const DDS_Char,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_to_array(
        self_: *const DDS_StringSeq,
        dstArray: *mut *mut DDS_Char,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_loan_contiguous(
        self_: *mut DDS_StringSeq,
        buffer: *mut *mut DDS_Char,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_loan_discontiguous(
        self_: *mut DDS_StringSeq,
        buffer: *mut *mut *mut DDS_Char,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_unloan(self_: *mut DDS_StringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_get_contiguous_buffer(self_: *const DDS_StringSeq) -> *mut *mut DDS_Char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_get_discontiguous_buffer(
        self_: *const DDS_StringSeq,
    ) -> *mut *mut *mut DDS_Char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_get_reader_and_data_ptr(
        self_: *const DDS_StringSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_set_reader_and_data_ptr(
        self_: *mut DDS_StringSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_has_ownership(self_: *const DDS_StringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_clear(self_: *mut DDS_StringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_finalize(self_: *mut DDS_StringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_shallow_copy(self_: *mut DDS_StringSeq, other: *mut DDS_StringSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSeq_initialize_ex(
        self_: *mut DDS_StringSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringInnerCopyEx(
        dst: *mut DDS_String,
        src: *mut *const DDS_Char,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringCompare(
        first: *const *const DDS_Char,
        second: *const *const DDS_Char,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringInitialize(self_: *mut DDS_String) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringInitializeEx(
        self_: *mut DDS_String,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringFinalize(self_: *mut DDS_String);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringFinalizeEx(
        self_: *mut DDS_String,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringCopySample(dst: *mut DDS_String, src: *const DDS_String) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringCopyEx(
        dst: *mut DDS_String,
        src: *const DDS_String,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringPrintData(sample: *const DDS_String);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringCreateSample(
        pool: *mut ZRMemPool,
        allocMutable: ZR_BOOLEAN,
    ) -> *mut DDS_String;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_String);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringGetSerializedSampleSize(
        sample: *const DDS_String,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSerialize(sample: *const DDS_String, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringDeserialize(
        sample: *mut DDS_String,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringGetSerializedKeySize(
        sample: *const DDS_String,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringSerializeKey(sample: *const DDS_String, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringDeserializeKey(
        sample: *mut DDS_String,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringGetKeyHash(
        sample: *const DDS_String,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_StringOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanInitialize(self_: *mut DDS_Boolean) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanInitializeEx(
        self_: *mut DDS_Boolean,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanFinalize(self_: *mut DDS_Boolean);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanFinalizeEx(
        self_: *mut DDS_Boolean,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanCopySample(dst: *mut DDS_Boolean, src: *const DDS_Boolean) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanCopyEx(
        dst: *mut DDS_Boolean,
        src: *const DDS_Boolean,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanPrintData(sample: *const DDS_Boolean);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanCreateSample(
        pool: *mut ZRMemPool,
        allocMutable: ZR_BOOLEAN,
    ) -> *mut DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_Boolean);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanGetSerializedSampleSize(
        sample: *const DDS_Boolean,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSerialize(sample: *const DDS_Boolean, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanDeserialize(
        sample: *mut DDS_Boolean,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanGetSerializedKeySize(
        sample: *const DDS_Boolean,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanSerializeKey(sample: *const DDS_Boolean, cdr: *mut CDRSerializer)
    -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanDeserializeKey(
        sample: *mut DDS_Boolean,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanGetKeyHash(
        sample: *const DDS_Boolean,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BooleanOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetInitialize(self_: *mut DDS_Octet) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetInitializeEx(
        self_: *mut DDS_Octet,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetFinalize(self_: *mut DDS_Octet);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetFinalizeEx(
        self_: *mut DDS_Octet,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetCopySample(dst: *mut DDS_Octet, src: *const DDS_Octet) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetCopyEx(
        dst: *mut DDS_Octet,
        src: *const DDS_Octet,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetPrintData(sample: *const DDS_Octet);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetCreateSample(pool: *mut ZRMemPool, allocMutable: ZR_BOOLEAN) -> *mut DDS_Octet;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_Octet);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetGetSerializedSampleSize(
        sample: *const DDS_Octet,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSerialize(sample: *const DDS_Octet, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetDeserialize(
        sample: *mut DDS_Octet,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetGetSerializedKeySize(
        sample: *const DDS_Octet,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetSerializeKey(sample: *const DDS_Octet, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetDeserializeKey(
        sample: *mut DDS_Octet,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetGetKeyHash(
        sample: *const DDS_Octet,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_OctetOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharInitialize(self_: *mut DDS_Char) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharInitializeEx(
        self_: *mut DDS_Char,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharFinalize(self_: *mut DDS_Char);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharFinalizeEx(
        self_: *mut DDS_Char,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharCopySample(dst: *mut DDS_Char, src: *const DDS_Char) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharCopyEx(
        dst: *mut DDS_Char,
        src: *const DDS_Char,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharPrintData(sample: *const DDS_Char);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharCreateSample(pool: *mut ZRMemPool, allocMutable: ZR_BOOLEAN) -> *mut DDS_Char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_Char);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharGetSerializedSampleSize(
        sample: *const DDS_Char,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSerialize(sample: *const DDS_Char, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharDeserialize(
        sample: *mut DDS_Char,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharGetSerializedKeySize(
        sample: *const DDS_Char,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharSerializeKey(sample: *const DDS_Char, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharDeserializeKey(
        sample: *mut DDS_Char,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharGetKeyHash(
        sample: *const DDS_Char,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharNoSerializingSupported(typesupport: *const ::std::os::raw::c_void)
    -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_CharOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortInitialize(self_: *mut DDS_Short) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortInitializeEx(
        self_: *mut DDS_Short,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortFinalize(self_: *mut DDS_Short);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortFinalizeEx(
        self_: *mut DDS_Short,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortCopySample(dst: *mut DDS_Short, src: *const DDS_Short) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortCopyEx(
        dst: *mut DDS_Short,
        src: *const DDS_Short,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortPrintData(sample: *const DDS_Short);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortCreateSample(pool: *mut ZRMemPool, allocMutable: ZR_BOOLEAN) -> *mut DDS_Short;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_Short);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortGetSerializedSampleSize(
        sample: *const DDS_Short,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSerialize(sample: *const DDS_Short, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortDeserialize(
        sample: *mut DDS_Short,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortGetSerializedKeySize(
        sample: *const DDS_Short,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortSerializeKey(sample: *const DDS_Short, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortDeserializeKey(
        sample: *mut DDS_Short,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortGetKeyHash(
        sample: *const DDS_Short,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ShortOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortInitialize(self_: *mut DDS_UShort) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortInitializeEx(
        self_: *mut DDS_UShort,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortFinalize(self_: *mut DDS_UShort);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortFinalizeEx(
        self_: *mut DDS_UShort,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortCopySample(dst: *mut DDS_UShort, src: *const DDS_UShort) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortCopyEx(
        dst: *mut DDS_UShort,
        src: *const DDS_UShort,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortPrintData(sample: *const DDS_UShort);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortCreateSample(
        pool: *mut ZRMemPool,
        allocMutable: ZR_BOOLEAN,
    ) -> *mut DDS_UShort;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_UShort);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortGetSerializedSampleSize(
        sample: *const DDS_UShort,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSerialize(sample: *const DDS_UShort, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortDeserialize(
        sample: *mut DDS_UShort,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortGetSerializedKeySize(
        sample: *const DDS_UShort,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortSerializeKey(sample: *const DDS_UShort, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortDeserializeKey(
        sample: *mut DDS_UShort,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortGetKeyHash(
        sample: *const DDS_UShort,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_UShortOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongInitialize(self_: *mut DDS_Long) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongInitializeEx(
        self_: *mut DDS_Long,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongFinalize(self_: *mut DDS_Long);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongFinalizeEx(
        self_: *mut DDS_Long,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongCopySample(dst: *mut DDS_Long, src: *const DDS_Long) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongCopyEx(
        dst: *mut DDS_Long,
        src: *const DDS_Long,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongPrintData(sample: *const DDS_Long);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongCreateSample(pool: *mut ZRMemPool, allocMutable: ZR_BOOLEAN) -> *mut DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_Long);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongGetSerializedSampleSize(
        sample: *const DDS_Long,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSerialize(sample: *const DDS_Long, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongDeserialize(
        sample: *mut DDS_Long,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongGetSerializedKeySize(
        sample: *const DDS_Long,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongSerializeKey(sample: *const DDS_Long, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongDeserializeKey(
        sample: *mut DDS_Long,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongGetKeyHash(
        sample: *const DDS_Long,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongNoSerializingSupported(typesupport: *const ::std::os::raw::c_void)
    -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongInitialize(self_: *mut DDS_ULong) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongInitializeEx(
        self_: *mut DDS_ULong,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongFinalize(self_: *mut DDS_ULong);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongFinalizeEx(
        self_: *mut DDS_ULong,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongCopySample(dst: *mut DDS_ULong, src: *const DDS_ULong) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongCopyEx(
        dst: *mut DDS_ULong,
        src: *const DDS_ULong,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongPrintData(sample: *const DDS_ULong);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongCreateSample(pool: *mut ZRMemPool, allocMutable: ZR_BOOLEAN) -> *mut DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_ULong);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongGetSerializedSampleSize(
        sample: *const DDS_ULong,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSerialize(sample: *const DDS_ULong, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongDeserialize(
        sample: *mut DDS_ULong,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongGetSerializedKeySize(
        sample: *const DDS_ULong,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongSerializeKey(sample: *const DDS_ULong, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongDeserializeKey(
        sample: *mut DDS_ULong,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongGetKeyHash(
        sample: *const DDS_ULong,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongInitialize(self_: *mut DDS_LongLong) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongInitializeEx(
        self_: *mut DDS_LongLong,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongFinalize(self_: *mut DDS_LongLong);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongFinalizeEx(
        self_: *mut DDS_LongLong,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongCopySample(dst: *mut DDS_LongLong, src: *const DDS_LongLong) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongCopyEx(
        dst: *mut DDS_LongLong,
        src: *const DDS_LongLong,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongPrintData(sample: *const DDS_LongLong);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongCreateSample(
        pool: *mut ZRMemPool,
        allocMutable: ZR_BOOLEAN,
    ) -> *mut DDS_LongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_LongLong);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongGetSerializedSampleSize(
        sample: *const DDS_LongLong,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSerialize(sample: *const DDS_LongLong, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongDeserialize(
        sample: *mut DDS_LongLong,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongGetSerializedKeySize(
        sample: *const DDS_LongLong,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongSerializeKey(
        sample: *const DDS_LongLong,
        cdr: *mut CDRSerializer,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongDeserializeKey(
        sample: *mut DDS_LongLong,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongGetKeyHash(
        sample: *const DDS_LongLong,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_LongLongOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongInitialize(self_: *mut DDS_ULongLong) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongInitializeEx(
        self_: *mut DDS_ULongLong,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongFinalize(self_: *mut DDS_ULongLong);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongFinalizeEx(
        self_: *mut DDS_ULongLong,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongCopySample(
        dst: *mut DDS_ULongLong,
        src: *const DDS_ULongLong,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongCopyEx(
        dst: *mut DDS_ULongLong,
        src: *const DDS_ULongLong,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongPrintData(sample: *const DDS_ULongLong);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongCreateSample(
        pool: *mut ZRMemPool,
        allocMutable: ZR_BOOLEAN,
    ) -> *mut DDS_ULongLong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_ULongLong);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongGetSerializedSampleSize(
        sample: *const DDS_ULongLong,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSerialize(
        sample: *const DDS_ULongLong,
        cdr: *mut CDRSerializer,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongDeserialize(
        sample: *mut DDS_ULongLong,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongGetSerializedKeySize(
        sample: *const DDS_ULongLong,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongSerializeKey(
        sample: *const DDS_ULongLong,
        cdr: *mut CDRSerializer,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongDeserializeKey(
        sample: *mut DDS_ULongLong,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongGetKeyHash(
        sample: *const DDS_ULongLong,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ULongLongOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatInitialize(self_: *mut DDS_Float) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatInitializeEx(
        self_: *mut DDS_Float,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatFinalize(self_: *mut DDS_Float);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatFinalizeEx(
        self_: *mut DDS_Float,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatCopySample(dst: *mut DDS_Float, src: *const DDS_Float) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatCopyEx(
        dst: *mut DDS_Float,
        src: *const DDS_Float,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatPrintData(sample: *const DDS_Float);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatCreateSample(pool: *mut ZRMemPool, allocMutable: ZR_BOOLEAN) -> *mut DDS_Float;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_Float);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatGetSerializedSampleSize(
        sample: *const DDS_Float,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSerialize(sample: *const DDS_Float, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatDeserialize(
        sample: *mut DDS_Float,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatGetSerializedKeySize(
        sample: *const DDS_Float,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatSerializeKey(sample: *const DDS_Float, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatDeserializeKey(
        sample: *mut DDS_Float,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatGetKeyHash(
        sample: *const DDS_Float,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_FloatOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleInitialize(self_: *mut DDS_Double) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleInitializeEx(
        self_: *mut DDS_Double,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleFinalize(self_: *mut DDS_Double);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleFinalizeEx(
        self_: *mut DDS_Double,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleCopySample(dst: *mut DDS_Double, src: *const DDS_Double) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleCopyEx(
        dst: *mut DDS_Double,
        src: *const DDS_Double,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoublePrintData(sample: *const DDS_Double);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleCreateSample(
        pool: *mut ZRMemPool,
        allocMutable: ZR_BOOLEAN,
    ) -> *mut DDS_Double;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_Double);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleGetSerializedSampleSize(
        sample: *const DDS_Double,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSerialize(sample: *const DDS_Double, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleDeserialize(
        sample: *mut DDS_Double,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleGetSerializedKeySize(
        sample: *const DDS_Double,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleSerializeKey(sample: *const DDS_Double, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleDeserializeKey(
        sample: *mut DDS_Double,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleGetKeyHash(
        sample: *const DDS_Double,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_DoubleOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_KeyedString {
    pub key: *mut DDS_Char,
    pub value: *mut DDS_Char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_KeyedString"][::std::mem::size_of::<DDS_KeyedString>() - 16usize];
    ["Alignment of DDS_KeyedString"][::std::mem::align_of::<DDS_KeyedString>() - 8usize];
    ["Offset of field: DDS_KeyedString::key"]
        [::std::mem::offset_of!(DDS_KeyedString, key) - 0usize];
    ["Offset of field: DDS_KeyedString::value"]
        [::std::mem::offset_of!(DDS_KeyedString, value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_KeyedStringSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_KeyedString,
    pub _discontiguousBuffer: *mut *mut DDS_KeyedString,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_KeyedStringSeq"][::std::mem::size_of::<DDS_KeyedStringSeq>() - 72usize];
    ["Alignment of DDS_KeyedStringSeq"][::std::mem::align_of::<DDS_KeyedStringSeq>() - 8usize];
    ["Offset of field: DDS_KeyedStringSeq::_owned"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _owned) - 0usize];
    ["Offset of field: DDS_KeyedStringSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_KeyedStringSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_KeyedStringSeq::_maximum"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _maximum) - 24usize];
    ["Offset of field: DDS_KeyedStringSeq::_length"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _length) - 28usize];
    ["Offset of field: DDS_KeyedStringSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_KeyedStringSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_KeyedStringSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_KeyedStringSeq::_mempool"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _mempool) - 56usize];
    ["Offset of field: DDS_KeyedStringSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_KeyedStringSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_is_initialized(self_: *const DDS_KeyedStringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_set(
        self_: *mut DDS_KeyedStringSeq,
        index: DDS_ULong,
        newValue: *const DDS_KeyedString,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_initialize(self_: *mut DDS_KeyedStringSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_new(newMax: DDS_ULong) -> *mut DDS_KeyedStringSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_get_maximum(self_: *const DDS_KeyedStringSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_set_maximum(
        self_: *mut DDS_KeyedStringSeq,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_get_length(self_: *const DDS_KeyedStringSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_set_length(
        self_: *mut DDS_KeyedStringSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_ensure_length(
        self_: *mut DDS_KeyedStringSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_get_reference(
        self_: *const DDS_KeyedStringSeq,
        index: DDS_ULong,
    ) -> *mut DDS_KeyedString;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_append(
        self_: *mut DDS_KeyedStringSeq,
        newValue: *const DDS_KeyedString,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_append_autosize(
        self_: *mut DDS_KeyedStringSeq,
        newValue: *const DDS_KeyedString,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_copy_no_alloc(
        self_: *mut DDS_KeyedStringSeq,
        src: *const DDS_KeyedStringSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_copy(
        self_: *mut DDS_KeyedStringSeq,
        src: *const DDS_KeyedStringSeq,
    ) -> *mut DDS_KeyedStringSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_compare(
        self_: *const DDS_KeyedStringSeq,
        src: *const DDS_KeyedStringSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_from_array(
        self_: *mut DDS_KeyedStringSeq,
        srcArray: *const DDS_KeyedString,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_to_array(
        self_: *const DDS_KeyedStringSeq,
        dstArray: *mut DDS_KeyedString,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_loan_contiguous(
        self_: *mut DDS_KeyedStringSeq,
        buffer: *mut DDS_KeyedString,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_loan_discontiguous(
        self_: *mut DDS_KeyedStringSeq,
        buffer: *mut *mut DDS_KeyedString,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_unloan(self_: *mut DDS_KeyedStringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_get_contiguous_buffer(
        self_: *const DDS_KeyedStringSeq,
    ) -> *mut DDS_KeyedString;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_get_discontiguous_buffer(
        self_: *const DDS_KeyedStringSeq,
    ) -> *mut *mut DDS_KeyedString;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_get_reader_and_data_ptr(
        self_: *const DDS_KeyedStringSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_set_reader_and_data_ptr(
        self_: *mut DDS_KeyedStringSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_has_ownership(self_: *const DDS_KeyedStringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_clear(self_: *mut DDS_KeyedStringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_finalize(self_: *mut DDS_KeyedStringSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_shallow_copy(
        self_: *mut DDS_KeyedStringSeq,
        other: *mut DDS_KeyedStringSeq,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSeq_initialize_ex(
        self_: *mut DDS_KeyedStringSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringInitialize(self_: *mut DDS_KeyedString) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringInitializeEx(
        self_: *mut DDS_KeyedString,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringFinalize(self_: *mut DDS_KeyedString);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringFinalizeEx(
        self_: *mut DDS_KeyedString,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringCopySample(
        dst: *mut DDS_KeyedString,
        src: *const DDS_KeyedString,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringCopyEx(
        dst: *mut DDS_KeyedString,
        src: *const DDS_KeyedString,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringPrintData(sample: *const DDS_KeyedString);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringCreateSample(
        pool: *mut ZRMemPool,
        allocMutable: ZR_BOOLEAN,
    ) -> *mut DDS_KeyedString;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_KeyedString);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringGetSerializedSampleSize(
        sample: *const DDS_KeyedString,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSerialize(
        sample: *const DDS_KeyedString,
        cdr: *mut CDRSerializer,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringDeserialize(
        sample: *mut DDS_KeyedString,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringGetSerializedKeySize(
        sample: *const DDS_KeyedString,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringSerializeKey(
        sample: *const DDS_KeyedString,
        cdr: *mut CDRSerializer,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringDeserializeKey(
        sample: *mut DDS_KeyedString,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringGetKeyHash(
        sample: *const DDS_KeyedString,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringFixedHeaderLength(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedStringOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_Bytes {
    pub value: DDS_OctetSeq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_Bytes"][::std::mem::size_of::<DDS_Bytes>() - 72usize];
    ["Alignment of DDS_Bytes"][::std::mem::align_of::<DDS_Bytes>() - 8usize];
    ["Offset of field: DDS_Bytes::value"][::std::mem::offset_of!(DDS_Bytes, value) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_BytesSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_Bytes,
    pub _discontiguousBuffer: *mut *mut DDS_Bytes,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_BytesSeq"][::std::mem::size_of::<DDS_BytesSeq>() - 72usize];
    ["Alignment of DDS_BytesSeq"][::std::mem::align_of::<DDS_BytesSeq>() - 8usize];
    ["Offset of field: DDS_BytesSeq::_owned"]
        [::std::mem::offset_of!(DDS_BytesSeq, _owned) - 0usize];
    ["Offset of field: DDS_BytesSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_BytesSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_BytesSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_BytesSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_BytesSeq::_maximum"]
        [::std::mem::offset_of!(DDS_BytesSeq, _maximum) - 24usize];
    ["Offset of field: DDS_BytesSeq::_length"]
        [::std::mem::offset_of!(DDS_BytesSeq, _length) - 28usize];
    ["Offset of field: DDS_BytesSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_BytesSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_BytesSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_BytesSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_BytesSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_BytesSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_BytesSeq::_mempool"]
        [::std::mem::offset_of!(DDS_BytesSeq, _mempool) - 56usize];
    ["Offset of field: DDS_BytesSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_BytesSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_is_initialized(self_: *const DDS_BytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_set(
        self_: *mut DDS_BytesSeq,
        index: DDS_ULong,
        newValue: *const DDS_Bytes,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_initialize(self_: *mut DDS_BytesSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_new(newMax: DDS_ULong) -> *mut DDS_BytesSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_get_maximum(self_: *const DDS_BytesSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_set_maximum(self_: *mut DDS_BytesSeq, newMax: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_get_length(self_: *const DDS_BytesSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_set_length(self_: *mut DDS_BytesSeq, newLength: DDS_ULong) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_ensure_length(
        self_: *mut DDS_BytesSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_get_reference(
        self_: *const DDS_BytesSeq,
        index: DDS_ULong,
    ) -> *mut DDS_Bytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_append(self_: *mut DDS_BytesSeq, newValue: *const DDS_Bytes)
    -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_append_autosize(
        self_: *mut DDS_BytesSeq,
        newValue: *const DDS_Bytes,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_copy_no_alloc(
        self_: *mut DDS_BytesSeq,
        src: *const DDS_BytesSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_copy(
        self_: *mut DDS_BytesSeq,
        src: *const DDS_BytesSeq,
    ) -> *mut DDS_BytesSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_compare(self_: *const DDS_BytesSeq, src: *const DDS_BytesSeq) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_from_array(
        self_: *mut DDS_BytesSeq,
        srcArray: *const DDS_Bytes,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_to_array(
        self_: *const DDS_BytesSeq,
        dstArray: *mut DDS_Bytes,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_loan_contiguous(
        self_: *mut DDS_BytesSeq,
        buffer: *mut DDS_Bytes,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_loan_discontiguous(
        self_: *mut DDS_BytesSeq,
        buffer: *mut *mut DDS_Bytes,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_unloan(self_: *mut DDS_BytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_get_contiguous_buffer(self_: *const DDS_BytesSeq) -> *mut DDS_Bytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_get_discontiguous_buffer(self_: *const DDS_BytesSeq)
    -> *mut *mut DDS_Bytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_get_reader_and_data_ptr(
        self_: *const DDS_BytesSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_set_reader_and_data_ptr(
        self_: *mut DDS_BytesSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_has_ownership(self_: *const DDS_BytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_clear(self_: *mut DDS_BytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_finalize(self_: *mut DDS_BytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_shallow_copy(self_: *mut DDS_BytesSeq, other: *mut DDS_BytesSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSeq_initialize_ex(
        self_: *mut DDS_BytesSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesInitialize(self_: *mut DDS_Bytes) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesInitializeEx(
        self_: *mut DDS_Bytes,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesFinalize(self_: *mut DDS_Bytes);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesFinalizeEx(
        self_: *mut DDS_Bytes,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesCopySample(dst: *mut DDS_Bytes, src: *const DDS_Bytes) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesCopyEx(
        dst: *mut DDS_Bytes,
        src: *const DDS_Bytes,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesPrintData(sample: *const DDS_Bytes);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesCreateSample(pool: *mut ZRMemPool, allocMutable: ZR_BOOLEAN) -> *mut DDS_Bytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_Bytes);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesGetSerializedSampleSize(
        sample: *const DDS_Bytes,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSerialize(sample: *const DDS_Bytes, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesDeserialize(
        sample: *mut DDS_Bytes,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesGetSerializedKeySize(
        sample: *const DDS_Bytes,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesSerializeKey(sample: *const DDS_Bytes, cdr: *mut CDRSerializer) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesDeserializeKey(
        sample: *mut DDS_Bytes,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesGetKeyHash(
        sample: *const DDS_Bytes,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesFixedHeaderLength(typesupport: *const ::std::os::raw::c_void) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_BytesOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_KeyedBytes {
    pub key: *mut DDS_Char,
    pub value: DDS_OctetSeq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_KeyedBytes"][::std::mem::size_of::<DDS_KeyedBytes>() - 80usize];
    ["Alignment of DDS_KeyedBytes"][::std::mem::align_of::<DDS_KeyedBytes>() - 8usize];
    ["Offset of field: DDS_KeyedBytes::key"][::std::mem::offset_of!(DDS_KeyedBytes, key) - 0usize];
    ["Offset of field: DDS_KeyedBytes::value"]
        [::std::mem::offset_of!(DDS_KeyedBytes, value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_KeyedBytesSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_KeyedBytes,
    pub _discontiguousBuffer: *mut *mut DDS_KeyedBytes,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_KeyedBytesSeq"][::std::mem::size_of::<DDS_KeyedBytesSeq>() - 72usize];
    ["Alignment of DDS_KeyedBytesSeq"][::std::mem::align_of::<DDS_KeyedBytesSeq>() - 8usize];
    ["Offset of field: DDS_KeyedBytesSeq::_owned"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _owned) - 0usize];
    ["Offset of field: DDS_KeyedBytesSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_KeyedBytesSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_KeyedBytesSeq::_maximum"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _maximum) - 24usize];
    ["Offset of field: DDS_KeyedBytesSeq::_length"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _length) - 28usize];
    ["Offset of field: DDS_KeyedBytesSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_KeyedBytesSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_KeyedBytesSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_KeyedBytesSeq::_mempool"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _mempool) - 56usize];
    ["Offset of field: DDS_KeyedBytesSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_KeyedBytesSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_is_initialized(self_: *const DDS_KeyedBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_set(
        self_: *mut DDS_KeyedBytesSeq,
        index: DDS_ULong,
        newValue: *const DDS_KeyedBytes,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_initialize(self_: *mut DDS_KeyedBytesSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_new(newMax: DDS_ULong) -> *mut DDS_KeyedBytesSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_get_maximum(self_: *const DDS_KeyedBytesSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_set_maximum(
        self_: *mut DDS_KeyedBytesSeq,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_get_length(self_: *const DDS_KeyedBytesSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_set_length(
        self_: *mut DDS_KeyedBytesSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_ensure_length(
        self_: *mut DDS_KeyedBytesSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_get_reference(
        self_: *const DDS_KeyedBytesSeq,
        index: DDS_ULong,
    ) -> *mut DDS_KeyedBytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_append(
        self_: *mut DDS_KeyedBytesSeq,
        newValue: *const DDS_KeyedBytes,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_append_autosize(
        self_: *mut DDS_KeyedBytesSeq,
        newValue: *const DDS_KeyedBytes,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_copy_no_alloc(
        self_: *mut DDS_KeyedBytesSeq,
        src: *const DDS_KeyedBytesSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_copy(
        self_: *mut DDS_KeyedBytesSeq,
        src: *const DDS_KeyedBytesSeq,
    ) -> *mut DDS_KeyedBytesSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_compare(
        self_: *const DDS_KeyedBytesSeq,
        src: *const DDS_KeyedBytesSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_from_array(
        self_: *mut DDS_KeyedBytesSeq,
        srcArray: *const DDS_KeyedBytes,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_to_array(
        self_: *const DDS_KeyedBytesSeq,
        dstArray: *mut DDS_KeyedBytes,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_loan_contiguous(
        self_: *mut DDS_KeyedBytesSeq,
        buffer: *mut DDS_KeyedBytes,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_loan_discontiguous(
        self_: *mut DDS_KeyedBytesSeq,
        buffer: *mut *mut DDS_KeyedBytes,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_unloan(self_: *mut DDS_KeyedBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_get_contiguous_buffer(
        self_: *const DDS_KeyedBytesSeq,
    ) -> *mut DDS_KeyedBytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_get_discontiguous_buffer(
        self_: *const DDS_KeyedBytesSeq,
    ) -> *mut *mut DDS_KeyedBytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_get_reader_and_data_ptr(
        self_: *const DDS_KeyedBytesSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_set_reader_and_data_ptr(
        self_: *mut DDS_KeyedBytesSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_has_ownership(self_: *const DDS_KeyedBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_clear(self_: *mut DDS_KeyedBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_finalize(self_: *mut DDS_KeyedBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_shallow_copy(
        self_: *mut DDS_KeyedBytesSeq,
        other: *mut DDS_KeyedBytesSeq,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSeq_initialize_ex(
        self_: *mut DDS_KeyedBytesSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesInitialize(self_: *mut DDS_KeyedBytes) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesInitializeEx(
        self_: *mut DDS_KeyedBytes,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesFinalize(self_: *mut DDS_KeyedBytes);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesFinalizeEx(
        self_: *mut DDS_KeyedBytes,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesCopySample(
        dst: *mut DDS_KeyedBytes,
        src: *const DDS_KeyedBytes,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesCopyEx(
        dst: *mut DDS_KeyedBytes,
        src: *const DDS_KeyedBytes,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesPrintData(sample: *const DDS_KeyedBytes);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesCreateSample(
        pool: *mut ZRMemPool,
        allocMutable: ZR_BOOLEAN,
    ) -> *mut DDS_KeyedBytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_KeyedBytes);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesGetSerializedSampleSize(
        sample: *const DDS_KeyedBytes,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSerialize(
        sample: *const DDS_KeyedBytes,
        cdr: *mut CDRSerializer,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesDeserialize(
        sample: *mut DDS_KeyedBytes,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesGetSerializedKeySize(
        sample: *const DDS_KeyedBytes,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesSerializeKey(
        sample: *const DDS_KeyedBytes,
        cdr: *mut CDRSerializer,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesDeserializeKey(
        sample: *mut DDS_KeyedBytes,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesGetKeyHash(
        sample: *const DDS_KeyedBytes,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesFixedHeaderLength(typesupport: *const ::std::os::raw::c_void)
    -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_KeyedBytesOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_ZeroCopyBytes {
    pub totalLength: DDS_Long,
    pub reservedLength: DDS_Long,
    pub value: *mut DDS_Char,
    pub userBuffer: *mut DDS_Char,
    pub userLength: DDS_Long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_ZeroCopyBytes"][::std::mem::size_of::<DDS_ZeroCopyBytes>() - 32usize];
    ["Alignment of DDS_ZeroCopyBytes"][::std::mem::align_of::<DDS_ZeroCopyBytes>() - 8usize];
    ["Offset of field: DDS_ZeroCopyBytes::totalLength"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytes, totalLength) - 0usize];
    ["Offset of field: DDS_ZeroCopyBytes::reservedLength"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytes, reservedLength) - 4usize];
    ["Offset of field: DDS_ZeroCopyBytes::value"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytes, value) - 8usize];
    ["Offset of field: DDS_ZeroCopyBytes::userBuffer"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytes, userBuffer) - 16usize];
    ["Offset of field: DDS_ZeroCopyBytes::userLength"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytes, userLength) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_ZeroCopyBytesSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_ZeroCopyBytes,
    pub _discontiguousBuffer: *mut *mut DDS_ZeroCopyBytes,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_ZeroCopyBytesSeq"][::std::mem::size_of::<DDS_ZeroCopyBytesSeq>() - 72usize];
    ["Alignment of DDS_ZeroCopyBytesSeq"][::std::mem::align_of::<DDS_ZeroCopyBytesSeq>() - 8usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_owned"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _owned) - 0usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_discontiguousBuffer"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _discontiguousBuffer) - 16usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_maximum"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _maximum) - 24usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_length"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _length) - 28usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_mempool"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _mempool) - 56usize];
    ["Offset of field: DDS_ZeroCopyBytesSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_ZeroCopyBytesSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_is_initialized(self_: *const DDS_ZeroCopyBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_set(
        self_: *mut DDS_ZeroCopyBytesSeq,
        index: DDS_ULong,
        newValue: *const DDS_ZeroCopyBytes,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_initialize(self_: *mut DDS_ZeroCopyBytesSeq);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_new(newMax: DDS_ULong) -> *mut DDS_ZeroCopyBytesSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_get_maximum(self_: *const DDS_ZeroCopyBytesSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_set_maximum(
        self_: *mut DDS_ZeroCopyBytesSeq,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_get_length(self_: *const DDS_ZeroCopyBytesSeq) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_set_length(
        self_: *mut DDS_ZeroCopyBytesSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_ensure_length(
        self_: *mut DDS_ZeroCopyBytesSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_get_reference(
        self_: *const DDS_ZeroCopyBytesSeq,
        index: DDS_ULong,
    ) -> *mut DDS_ZeroCopyBytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_append(
        self_: *mut DDS_ZeroCopyBytesSeq,
        newValue: *const DDS_ZeroCopyBytes,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_append_autosize(
        self_: *mut DDS_ZeroCopyBytesSeq,
        newValue: *const DDS_ZeroCopyBytes,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_copy_no_alloc(
        self_: *mut DDS_ZeroCopyBytesSeq,
        src: *const DDS_ZeroCopyBytesSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_copy(
        self_: *mut DDS_ZeroCopyBytesSeq,
        src: *const DDS_ZeroCopyBytesSeq,
    ) -> *mut DDS_ZeroCopyBytesSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_compare(
        self_: *const DDS_ZeroCopyBytesSeq,
        src: *const DDS_ZeroCopyBytesSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_from_array(
        self_: *mut DDS_ZeroCopyBytesSeq,
        srcArray: *const DDS_ZeroCopyBytes,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_to_array(
        self_: *const DDS_ZeroCopyBytesSeq,
        dstArray: *mut DDS_ZeroCopyBytes,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_loan_contiguous(
        self_: *mut DDS_ZeroCopyBytesSeq,
        buffer: *mut DDS_ZeroCopyBytes,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_loan_discontiguous(
        self_: *mut DDS_ZeroCopyBytesSeq,
        buffer: *mut *mut DDS_ZeroCopyBytes,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_unloan(self_: *mut DDS_ZeroCopyBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_get_contiguous_buffer(
        self_: *const DDS_ZeroCopyBytesSeq,
    ) -> *mut DDS_ZeroCopyBytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_get_discontiguous_buffer(
        self_: *const DDS_ZeroCopyBytesSeq,
    ) -> *mut *mut DDS_ZeroCopyBytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_get_reader_and_data_ptr(
        self_: *const DDS_ZeroCopyBytesSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_set_reader_and_data_ptr(
        self_: *mut DDS_ZeroCopyBytesSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_has_ownership(self_: *const DDS_ZeroCopyBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_clear(self_: *mut DDS_ZeroCopyBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_finalize(self_: *mut DDS_ZeroCopyBytesSeq) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_shallow_copy(
        self_: *mut DDS_ZeroCopyBytesSeq,
        other: *mut DDS_ZeroCopyBytesSeq,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSeq_initialize_ex(
        self_: *mut DDS_ZeroCopyBytesSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesInitialize(self_: *mut DDS_ZeroCopyBytes) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesInitializeEx(
        self_: *mut DDS_ZeroCopyBytes,
        pool: *mut ZRMemPool,
        allocateMemory: ZR_BOOLEAN,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesFinalize(self_: *mut DDS_ZeroCopyBytes);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesFinalizeEx(
        self_: *mut DDS_ZeroCopyBytes,
        pool: *mut ZRMemPool,
        deletePointers: ZR_BOOLEAN,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesCopySample(
        dst: *mut DDS_ZeroCopyBytes,
        src: *const DDS_ZeroCopyBytes,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesCopyEx(
        dst: *mut DDS_ZeroCopyBytes,
        src: *const DDS_ZeroCopyBytes,
        pool: *mut ZRMemPool,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesPrintData(sample: *const DDS_ZeroCopyBytes);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesGetTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesCreateSample(
        pool: *mut ZRMemPool,
        allocMutable: ZR_BOOLEAN,
    ) -> *mut DDS_ZeroCopyBytes;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesDestroySample(pool: *mut ZRMemPool, sample: *mut DDS_ZeroCopyBytes);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesGetSerializedSampleMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesGetSerializedSampleSize(
        sample: *const DDS_ZeroCopyBytes,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSerialize(
        sample: *const DDS_ZeroCopyBytes,
        cdr: *mut CDRSerializer,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesDeserialize(
        sample: *mut DDS_ZeroCopyBytes,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesGetSerializedKeyMaxSize() -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesGetSerializedKeySize(
        sample: *const DDS_ZeroCopyBytes,
        currentAlignment: ZR_UINT32,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesSerializeKey(
        sample: *const DDS_ZeroCopyBytes,
        cdr: *mut CDRSerializer,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesDeserializeKey(
        sample: *mut DDS_ZeroCopyBytes,
        cdr: *mut CDRDeserializer,
        pool: *mut ZRMemPool,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesGetKeyHash(
        sample: *const DDS_ZeroCopyBytes,
        cdr: *mut CDRSerializer,
        result: *mut DDS_KeyHash_t,
    ) -> ZR_INT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesHasKey() -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesGetInnerTypeCode() -> *mut TypeCodeHeader;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesNoSerializingSupported(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_BOOLEAN;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesFixedHeaderLength(
        typesupport: *const ::std::os::raw::c_void,
    ) -> ZR_UINT32;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_ZeroCopyBytesOnSiteDeserialize(
        cdr: *mut CDRDeserializer,
        sample: *mut ::std::os::raw::c_void,
        offset: ZR_UINT32,
        totalSize: ZR_UINT32,
        payload: *mut ZR_INT8,
        payloadLen: ZR_UINT32,
        fixedHeaderLen: ZR_UINT32,
    ) -> ZR_INT32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_UserDataQosPolicy {
    pub value: DDS_CharSeq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_UserDataQosPolicy"][::std::mem::size_of::<DDS_UserDataQosPolicy>() - 72usize];
    ["Alignment of DDS_UserDataQosPolicy"]
        [::std::mem::align_of::<DDS_UserDataQosPolicy>() - 8usize];
    ["Offset of field: DDS_UserDataQosPolicy::value"]
        [::std::mem::offset_of!(DDS_UserDataQosPolicy, value) - 0usize];
};
pub const DDS_OwnershipQosPolicyKind_DDS_SHARED_OWNERSHIP_QOS: DDS_OwnershipQosPolicyKind = 0;
pub const DDS_OwnershipQosPolicyKind_DDS_EXCLUSIVE_OWNERSHIP_QOS: DDS_OwnershipQosPolicyKind = 1;
pub type DDS_OwnershipQosPolicyKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_OwnershipQosPolicy {
    pub kind: DDS_OwnershipQosPolicyKind,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_OwnershipQosPolicy"][::std::mem::size_of::<DDS_OwnershipQosPolicy>() - 4usize];
    ["Alignment of DDS_OwnershipQosPolicy"]
        [::std::mem::align_of::<DDS_OwnershipQosPolicy>() - 4usize];
    ["Offset of field: DDS_OwnershipQosPolicy::kind"]
        [::std::mem::offset_of!(DDS_OwnershipQosPolicy, kind) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_OwnershipStrengthQosPolicy {
    pub value: DDS_Long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_OwnershipStrengthQosPolicy"]
        [::std::mem::size_of::<DDS_OwnershipStrengthQosPolicy>() - 4usize];
    ["Alignment of DDS_OwnershipStrengthQosPolicy"]
        [::std::mem::align_of::<DDS_OwnershipStrengthQosPolicy>() - 4usize];
    ["Offset of field: DDS_OwnershipStrengthQosPolicy::value"]
        [::std::mem::offset_of!(DDS_OwnershipStrengthQosPolicy, value) - 0usize];
};
pub const DDS_DestinationOrderQosPolicyKind_DDS_BY_RECEPTION_TIMESTAMP_DESTINATIONORDER_QOS:
    DDS_DestinationOrderQosPolicyKind = 0;
pub const DDS_DestinationOrderQosPolicyKind_DDS_BY_SOURCE_TIMESTAMP_DESTINATIONORDER_QOS:
    DDS_DestinationOrderQosPolicyKind = 1;
pub type DDS_DestinationOrderQosPolicyKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_DestinationOrderQosPolicy {
    pub kind: DDS_DestinationOrderQosPolicyKind,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_DestinationOrderQosPolicy"]
        [::std::mem::size_of::<DDS_DestinationOrderQosPolicy>() - 4usize];
    ["Alignment of DDS_DestinationOrderQosPolicy"]
        [::std::mem::align_of::<DDS_DestinationOrderQosPolicy>() - 4usize];
    ["Offset of field: DDS_DestinationOrderQosPolicy::kind"]
        [::std::mem::offset_of!(DDS_DestinationOrderQosPolicy, kind) - 0usize];
};
pub const DDS_PresentationQosPolicyAccessScopeKind_DDS_INSTANCE_PRESENTATION_QOS:
    DDS_PresentationQosPolicyAccessScopeKind = 0;
pub const DDS_PresentationQosPolicyAccessScopeKind_DDS_TOPIC_PRESENTATION_QOS:
    DDS_PresentationQosPolicyAccessScopeKind = 1;
pub const DDS_PresentationQosPolicyAccessScopeKind_DDS_GROUP_PRESENTATION_QOS:
    DDS_PresentationQosPolicyAccessScopeKind = 2;
pub type DDS_PresentationQosPolicyAccessScopeKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_PresentationQosPolicy {
    pub access_scope: DDS_PresentationQosPolicyAccessScopeKind,
    pub coherent_access: DDS_Boolean,
    pub ordered_access: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_PresentationQosPolicy"]
        [::std::mem::size_of::<DDS_PresentationQosPolicy>() - 8usize];
    ["Alignment of DDS_PresentationQosPolicy"]
        [::std::mem::align_of::<DDS_PresentationQosPolicy>() - 4usize];
    ["Offset of field: DDS_PresentationQosPolicy::access_scope"]
        [::std::mem::offset_of!(DDS_PresentationQosPolicy, access_scope) - 0usize];
    ["Offset of field: DDS_PresentationQosPolicy::coherent_access"]
        [::std::mem::offset_of!(DDS_PresentationQosPolicy, coherent_access) - 4usize];
    ["Offset of field: DDS_PresentationQosPolicy::ordered_access"]
        [::std::mem::offset_of!(DDS_PresentationQosPolicy, ordered_access) - 5usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_Property {
    pub name: *mut DDS_Char,
    pub value: *mut DDS_Char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_Property"][::std::mem::size_of::<DDS_Property>() - 16usize];
    ["Alignment of DDS_Property"][::std::mem::align_of::<DDS_Property>() - 8usize];
    ["Offset of field: DDS_Property::name"][::std::mem::offset_of!(DDS_Property, name) - 0usize];
    ["Offset of field: DDS_Property::value"][::std::mem::offset_of!(DDS_Property, value) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_PropertyList {
    pub size: DDS_ULong,
    pub buffer: [DDS_Property; 16usize],
    pub values: *mut DDS_Property,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_PropertyList"][::std::mem::size_of::<DDS_PropertyList>() - 272usize];
    ["Alignment of DDS_PropertyList"][::std::mem::align_of::<DDS_PropertyList>() - 8usize];
    ["Offset of field: DDS_PropertyList::size"]
        [::std::mem::offset_of!(DDS_PropertyList, size) - 0usize];
    ["Offset of field: DDS_PropertyList::buffer"]
        [::std::mem::offset_of!(DDS_PropertyList, buffer) - 8usize];
    ["Offset of field: DDS_PropertyList::values"]
        [::std::mem::offset_of!(DDS_PropertyList, values) - 264usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PropertyInitial(
        self_: *mut DDS_Property,
        name: *const DDS_Char,
        value: *const DDS_Char,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PropertyClear(self_: *mut DDS_Property) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PropertyListInitial(self_: *mut DDS_PropertyList);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PropertyListInsert(
        self_: *mut DDS_PropertyList,
        name: *const DDS_Char,
        value: *const DDS_Char,
        newPro: *mut DDS_Property,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PropertyListCopy(
        self_: *mut DDS_PropertyList,
        right: *const DDS_PropertyList,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PropertyListGet(
        self_: *mut DDS_PropertyList,
        name: *const ::std::os::raw::c_char,
    ) -> *mut DDS_Property;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PropertyListClear(self_: *mut DDS_PropertyList) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PropertyListAt(self_: *mut DDS_PropertyList, index: DDS_ULong) -> *mut DDS_Property;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_PartitionQosPolicy {
    pub name: DDS_StringSeq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_PartitionQosPolicy"][::std::mem::size_of::<DDS_PartitionQosPolicy>() - 72usize];
    ["Alignment of DDS_PartitionQosPolicy"]
        [::std::mem::align_of::<DDS_PartitionQosPolicy>() - 8usize];
    ["Offset of field: DDS_PartitionQosPolicy::name"]
        [::std::mem::offset_of!(DDS_PartitionQosPolicy, name) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_TopicDataQosPolicy {
    pub value: DDS_CharSeq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_TopicDataQosPolicy"][::std::mem::size_of::<DDS_TopicDataQosPolicy>() - 72usize];
    ["Alignment of DDS_TopicDataQosPolicy"]
        [::std::mem::align_of::<DDS_TopicDataQosPolicy>() - 8usize];
    ["Offset of field: DDS_TopicDataQosPolicy::value"]
        [::std::mem::offset_of!(DDS_TopicDataQosPolicy, value) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_GroupDataQosPolicy {
    pub value: DDS_CharSeq,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_GroupDataQosPolicy"][::std::mem::size_of::<DDS_GroupDataQosPolicy>() - 72usize];
    ["Alignment of DDS_GroupDataQosPolicy"]
        [::std::mem::align_of::<DDS_GroupDataQosPolicy>() - 8usize];
    ["Offset of field: DDS_GroupDataQosPolicy::value"]
        [::std::mem::offset_of!(DDS_GroupDataQosPolicy, value) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TypeObject {
    _unused: [u8; 0],
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn TypeObjectFactoryCloneTypeObject(typeObject: *const TypeObject) -> *mut TypeObject;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn TypeObjectFactoryDeleteTypeObject(typeObject: *mut TypeObject) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn TypeObjectAssignableFrom(type1: *const TypeObject, type2: *const TypeObject)
    -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn GetTypeObjectPrintableString(typeObject: *const TypeObject) -> *mut DDS_Char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ReleaseTypeObjectPrintableString(buffer: *mut DDS_Char);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn TypeObjectFactoryCreateFromTypeCode(typeCode: *mut TypeCodeHeader) -> *mut TypeObject;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn TypeObjectToTypeCode(typeObject: *const TypeObject) -> *mut TypeCodeHeader;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_PublicationBuiltinTopicData {
    pub key: DDS_BuiltinTopicKey_t,
    pub participant_key: DDS_BuiltinTopicKey_t,
    pub topic_name: *mut DDS_Char,
    pub type_name: *mut DDS_Char,
    pub durability: DDS_DurabilityQosPolicy,
    pub durability_service: DDS_DurabilityServiceQosPolicy,
    pub property_list: DDS_PropertyList,
    pub deadline: DDS_DeadlineQosPolicy,
    pub latency_budget: DDS_LatencyBudgetQosPolicy,
    pub liveliness: DDS_LivelinessQosPolicy,
    pub reliability: DDS_ReliabilityQosPolicy,
    pub lifespan: DDS_LifespanQosPolicy,
    pub user_data: DDS_UserDataQosPolicy,
    pub ownership: DDS_OwnershipQosPolicy,
    pub ownership_strength: DDS_OwnershipStrengthQosPolicy,
    pub destination_order: DDS_DestinationOrderQosPolicy,
    pub presention: DDS_PresentationQosPolicy,
    pub partition: DDS_PartitionQosPolicy,
    pub topic_data: DDS_TopicDataQosPolicy,
    pub group_data: DDS_GroupDataQosPolicy,
    pub type_object: *mut TypeObject,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_PublicationBuiltinTopicData"]
        [::std::mem::size_of::<DDS_PublicationBuiltinTopicData>() - 720usize];
    ["Alignment of DDS_PublicationBuiltinTopicData"]
        [::std::mem::align_of::<DDS_PublicationBuiltinTopicData>() - 8usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::key"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, key) - 0usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::participant_key"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, participant_key) - 16usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::topic_name"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, topic_name) - 32usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::type_name"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, type_name) - 40usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::durability"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, durability) - 48usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::durability_service"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, durability_service) - 52usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::property_list"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, property_list) - 80usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::deadline"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, deadline) - 352usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::latency_budget"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, latency_budget) - 360usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::liveliness"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, liveliness) - 368usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::reliability"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, reliability) - 380usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::lifespan"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, lifespan) - 392usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::user_data"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, user_data) - 400usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::ownership"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, ownership) - 472usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::ownership_strength"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, ownership_strength) - 476usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::destination_order"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, destination_order) - 480usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::presention"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, presention) - 484usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::partition"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, partition) - 496usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::topic_data"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, topic_data) - 568usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::group_data"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, group_data) - 640usize];
    ["Offset of field: DDS_PublicationBuiltinTopicData::type_object"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicData, type_object) - 712usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataInitial(self_: *mut DDS_PublicationBuiltinTopicData);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataDestroy(self_: *mut DDS_PublicationBuiltinTopicData);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataCopy(
        dst: *mut DDS_PublicationBuiltinTopicData,
        src: *const DDS_PublicationBuiltinTopicData,
    ) -> DDS_Long;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_PublicationBuiltinTopicDataSeq {
    pub _owned: DDS_Boolean,
    pub _contiguousBuffer: *mut DDS_PublicationBuiltinTopicData,
    pub _discontiguousBuffer: *mut *mut DDS_PublicationBuiltinTopicData,
    pub _maximum: DDS_ULong,
    pub _length: DDS_ULong,
    pub _sequenceInit: DDS_Long,
    pub _readerPtr: *mut ::std::os::raw::c_void,
    pub _dataPtr: *mut ::std::os::raw::c_void,
    pub _mempool: *mut ZRMemPool,
    pub _allocMemory: DDS_Boolean,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_PublicationBuiltinTopicDataSeq"]
        [::std::mem::size_of::<DDS_PublicationBuiltinTopicDataSeq>() - 72usize];
    ["Alignment of DDS_PublicationBuiltinTopicDataSeq"]
        [::std::mem::align_of::<DDS_PublicationBuiltinTopicDataSeq>() - 8usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_owned"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicDataSeq, _owned) - 0usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_contiguousBuffer"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicDataSeq, _contiguousBuffer) - 8usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_discontiguousBuffer"][::std::mem::offset_of!(
        DDS_PublicationBuiltinTopicDataSeq,
        _discontiguousBuffer
    ) - 16usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_maximum"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicDataSeq, _maximum) - 24usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_length"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicDataSeq, _length) - 28usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_sequenceInit"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicDataSeq, _sequenceInit) - 32usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_readerPtr"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicDataSeq, _readerPtr) - 40usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_dataPtr"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicDataSeq, _dataPtr) - 48usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_mempool"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicDataSeq, _mempool) - 56usize];
    ["Offset of field: DDS_PublicationBuiltinTopicDataSeq::_allocMemory"]
        [::std::mem::offset_of!(DDS_PublicationBuiltinTopicDataSeq, _allocMemory) - 64usize];
};
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_is_initialized(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_set(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        index: DDS_ULong,
        newValue: *const DDS_PublicationBuiltinTopicData,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_initialize(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_new(
        newMax: DDS_ULong,
    ) -> *mut DDS_PublicationBuiltinTopicDataSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_get_maximum(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
    ) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_set_maximum(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_get_length(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
    ) -> DDS_ULong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_set_length(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        newLength: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_ensure_length(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        length: DDS_ULong,
        max: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_get_reference(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
        index: DDS_ULong,
    ) -> *mut DDS_PublicationBuiltinTopicData;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_append(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        newValue: *const DDS_PublicationBuiltinTopicData,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_append_autosize(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        newValue: *const DDS_PublicationBuiltinTopicData,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_copy_no_alloc(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        src: *const DDS_PublicationBuiltinTopicDataSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_copy(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        src: *const DDS_PublicationBuiltinTopicDataSeq,
    ) -> *mut DDS_PublicationBuiltinTopicDataSeq;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_compare(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
        src: *const DDS_PublicationBuiltinTopicDataSeq,
    ) -> DDS_Long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_from_array(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        srcArray: *const DDS_PublicationBuiltinTopicData,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_to_array(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
        dstArray: *mut DDS_PublicationBuiltinTopicData,
        length: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_loan_contiguous(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        buffer: *mut DDS_PublicationBuiltinTopicData,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_loan_discontiguous(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        buffer: *mut *mut DDS_PublicationBuiltinTopicData,
        newLength: DDS_ULong,
        newMax: DDS_ULong,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_unloan(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_get_contiguous_buffer(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
    ) -> *mut DDS_PublicationBuiltinTopicData;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_get_discontiguous_buffer(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
    ) -> *mut *mut DDS_PublicationBuiltinTopicData;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_get_reader_and_data_ptr(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
        readerPtr: *mut *mut ::std::os::raw::c_void,
        dataPtr: *mut *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_set_reader_and_data_ptr(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        readerPtr: *mut ::std::os::raw::c_void,
        dataPtr: *mut ::std::os::raw::c_void,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_has_ownership(
        self_: *const DDS_PublicationBuiltinTopicDataSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_clear(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_finalize(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
    ) -> DDS_Boolean;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_shallow_copy(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        other: *mut DDS_PublicationBuiltinTopicDataSeq,
    );
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn DDS_PublicationBuiltinTopicDataSeq_initialize_ex(
        self_: *mut DDS_PublicationBuiltinTopicDataSeq,
        mempool: *mut ZRMemPool,
        allocateMemory: DDS_Boolean,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_SampleLostStatus {
    pub total_count: DDS_Long,
    pub total_count_change: DDS_Long,
    pub writer_handle: DDS_InstanceHandle_t,
    pub start_seq: DDS_SequenceNumber_t,
    pub end_seq: DDS_SequenceNumber_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_SampleLostStatus"][::std::mem::size_of::<DDS_SampleLostStatus>() - 44usize];
    ["Alignment of DDS_SampleLostStatus"][::std::mem::align_of::<DDS_SampleLostStatus>() - 4usize];
    ["Offset of field: DDS_SampleLostStatus::total_count"]
        [::std::mem::offset_of!(DDS_SampleLostStatus, total_count) - 0usize];
    ["Offset of field: DDS_SampleLostStatus::total_count_change"]
        [::std::mem::offset_of!(DDS_SampleLostStatus, total_count_change) - 4usize];
    ["Offset of field: DDS_SampleLostStatus::writer_handle"]
        [::std::mem::offset_of!(DDS_SampleLostStatus, writer_handle) - 8usize];
    ["Offset of field: DDS_SampleLostStatus::start_seq"]
        [::std::mem::offset_of!(DDS_SampleLostStatus, start_seq) - 28usize];
    ["Offset of field: DDS_SampleLostStatus::end_seq"]
        [::std::mem::offset_of!(DDS_SampleLostStatus, end_seq) - 36usize];
};
pub const DDS_SampleRejectedStatusKind_DDS_NOT_REJECTED: DDS_SampleRejectedStatusKind = 0;
pub const DDS_SampleRejectedStatusKind_DDS_REJECTED_BY_INSTANCE_LIMIT:
    DDS_SampleRejectedStatusKind = 1;
pub const DDS_SampleRejectedStatusKind_DDS_REJECTED_BY_SAMPLES_LIMIT: DDS_SampleRejectedStatusKind =
    2;
pub const DDS_SampleRejectedStatusKind_DDS_REJECTED_BY_SAMPLES_PER_INSTANCE_LIMIT:
    DDS_SampleRejectedStatusKind = 3;
pub type DDS_SampleRejectedStatusKind = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_SampleRejectedStatus {
    pub total_count: DDS_Long,
    pub total_count_change: DDS_Long,
    pub last_reason: DDS_SampleRejectedStatusKind,
    pub last_instance_handle: DDS_InstanceHandle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_SampleRejectedStatus"]
        [::std::mem::size_of::<DDS_SampleRejectedStatus>() - 32usize];
    ["Alignment of DDS_SampleRejectedStatus"]
        [::std::mem::align_of::<DDS_SampleRejectedStatus>() - 4usize];
    ["Offset of field: DDS_SampleRejectedStatus::total_count"]
        [::std::mem::offset_of!(DDS_SampleRejectedStatus, total_count) - 0usize];
    ["Offset of field: DDS_SampleRejectedStatus::total_count_change"]
        [::std::mem::offset_of!(DDS_SampleRejectedStatus, total_count_change) - 4usize];
    ["Offset of field: DDS_SampleRejectedStatus::last_reason"]
        [::std::mem::offset_of!(DDS_SampleRejectedStatus, last_reason) - 8usize];
    ["Offset of field: DDS_SampleRejectedStatus::last_instance_handle"]
        [::std::mem::offset_of!(DDS_SampleRejectedStatus, last_instance_handle) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_SubscriptionMatchedStatus {
    pub total_count: DDS_Long,
    pub total_count_change: DDS_Long,
    pub current_count: DDS_Long,
    pub current_count_change: DDS_Long,
    pub last_publication_handle: DDS_InstanceHandle_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_SubscriptionMatchedStatus"]
        [::std::mem::size_of::<DDS_SubscriptionMatchedStatus>() - 36usize];
    ["Alignment of DDS_SubscriptionMatchedStatus"]
        [::std::mem::align_of::<DDS_SubscriptionMatchedStatus>() - 4usize];
    ["Offset of field: DDS_SubscriptionMatchedStatus::total_count"]
        [::std::mem::offset_of!(DDS_SubscriptionMatchedStatus, total_count) - 0usize];
    ["Offset of field: DDS_SubscriptionMatchedStatus::total_count_change"]
        [::std::mem::offset_of!(DDS_SubscriptionMatchedStatus, total_count_change) - 4usize];
    ["Offset of field: DDS_SubscriptionMatchedStatus::current_count"]
        [::std::mem::offset_of!(DDS_SubscriptionMatchedStatus, current_count) - 8usize];
    ["Offset of field: DDS_SubscriptionMatchedStatus::current_count_change"]
        [::std::mem::offset_of!(DDS_SubscriptionMatchedStatus, current_count_change) - 12usize];
    ["Offset of field: DDS_SubscriptionMatchedStatus::last_publication_handle"]
        [::std::mem::offset_of!(DDS_SubscriptionMatchedStatus, last_publication_handle) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DDS_Listener {
    pub user_data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of DDS_Listener"][::std::mem::size_of::<DDS_Listener>() - 8usize];
    ["Alignment of DDS_Listener"][::std::mem::align_of::<DDS_Listener>() - 8usize];
    ["Offset of field: DDS_Listener::user_data"]
        [::std::mem::offset_of!(DDS_Listener, user_data) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ConditionImpl {
    _unused: [u8; 0],
}
pub type DDS_Condition = ConditionImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StatusConditionImpl {
    _unused: [u8; 0],
}
pub type DDS_StatusCondition = StatusConditionImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GuardConditionImpl {
    _unused: [u8; 0],
}
pub type DDS_GuardCondition = GuardConditionImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ReadConditionImpl {
    _unused: [u8; 0],
}
pub type DDS_ReadCondition = ReadConditionImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct QueryConditionImpl {
    _unused: [u8; 0],
}
pub type DDS_QueryCondition = QueryConditionImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WaitSetImpl {
    _unused: [u8; 0],
}
pub type DDS_WaitSet = WaitSetImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct EntityImpl {
    _unused: [u8; 0],
}
pub type DDS_Entity = EntityImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DataReaderImpl {
    _unused: [u8; 0],
}
pub type DDS_DataReader = DataReaderImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DataWriterImpl {
    _unused: [u8; 0],
}
pub type DDS_DataWriter = DataWriterImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TopicDescriptionImpl {
    _unused: [u8; 0],
}
pub type DDS_TopicDescription = TopicDescriptionImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TopicImpl {
    _unused: [u8; 0],
}
pub type DDS_Topic = TopicImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ContentFilteredTopicImpl {
    _unused: [u8; 0],
}
pub type DDS_ContentFilteredTopic = ContentFilteredTopicImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SubscriberImpl {
    _unused: [u8; 0],
}
pub type DDS_Subscriber = SubscriberImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct PublisherImpl {
    _unused: [u8; 0],
}
pub type DDS_Publisher = PublisherImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DomainParticipantImpl {
    _unused: [u8; 0],
}
pub type DDS_DomainParticipant = DomainParticipantImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DomainParticipantFactoryImpl {
    _unused: [u8; 0],
}
pub type DDS_DomainParticipantFactory = DomainParticipantFactoryImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ZRDynamicDataDataReader {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ZRDynamicDataTypeSupportImpl {
    _unused: [u8; 0],
}
pub type ZRDynamicDataTypeSupport = ZRDynamicDataTypeSupportImpl;
pub type TypeCode = TypeCodeHeader;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TypeCodeFactoryImpl {
    _unused: [u8; 0],
}
pub type TypeCodeFactory = TypeCodeFactoryImpl;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct DataWriterListenerImpl {
    _unused: [u8; 0],
}
pub type va_list = *mut ::std::os::raw::c_char;
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __security_init_cookie();
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo();
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::std::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::std::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::std::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::std::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::std::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::std::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::std::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::std::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::std::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _iobuf {
    pub _Placeholder: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _iobuf"][::std::mem::size_of::<_iobuf>() - 8usize];
    ["Alignment of _iobuf"][::std::mem::align_of::<_iobuf>() - 8usize];
    ["Offset of field: _iobuf::_Placeholder"]
        [::std::mem::offset_of!(_iobuf, _Placeholder) - 0usize];
};
pub type FILE = _iobuf;
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __acrt_iob_func(_Ix: ::std::os::raw::c_uint) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fgetwc(_Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fgetwchar() -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fputwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fputwchar(_Character: wchar_t) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn getwc(_Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn getwchar() -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fgetws(
        _Buffer: *mut wchar_t,
        _BufferCount: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> *mut wchar_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fputws(_Buffer: *const wchar_t, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _getws_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> *mut wchar_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn putwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn putwchar(_Character: wchar_t) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _putws(_Buffer: *const wchar_t) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ungetwc(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wfdopen(_FileHandle: ::std::os::raw::c_int, _Mode: *const wchar_t) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wfopen(_FileName: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wfopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
    ) -> errno_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wfreopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wfreopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wfsopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _ShFlag: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wperror(_ErrorMessage: *const wchar_t);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wpopen(_Command: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wremove(_FileName: *const wchar_t) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wtempnam(_Directory: *const wchar_t, _FilePrefix: *const wchar_t) -> *mut wchar_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wtmpnam_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> errno_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _wtmpnam(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fgetwc_nolock(_Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fputwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _getwc_nolock(_Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _putwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _ungetwc_nolock(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vfwprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vfwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vfwprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vfwscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vswprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vswprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vsnwprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vswprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vswscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *const wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
pub type fpos_t = ::std::os::raw::c_longlong;
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _get_stream_buffer_pointers(
        _Stream: *mut FILE,
        _Base: *mut *mut *mut ::std::os::raw::c_char,
        _Pointer: *mut *mut *mut ::std::os::raw::c_char,
        _Count: *mut *mut ::std::os::raw::c_int,
    ) -> errno_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn clearerr_s(_Stream: *mut FILE) -> errno_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fread_s(
        _Buffer: *mut ::std::os::raw::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn freopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn gets_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _Size: rsize_t,
    ) -> *mut ::std::os::raw::c_char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn tmpfile_s(_Stream: *mut *mut FILE) -> errno_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn tmpnam_s(_Buffer: *mut ::std::os::raw::c_char, _Size: rsize_t) -> errno_t;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn clearerr(_Stream: *mut FILE);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fclose(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fcloseall() -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fdopen(
        _FileHandle: ::std::os::raw::c_int,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn feof(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ferror(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fflush(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fgetc(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fgetchar() -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fgetpos(_Stream: *mut FILE, _Position: *mut fpos_t) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fgets(
        _Buffer: *mut ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fileno(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _flushall() -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fputc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fputchar(_Character: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fputs(
        _Buffer: *const ::std::os::raw::c_char,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fread(
        _Buffer: *mut ::std::os::raw::c_void,
        _ElementSize: ::std::os::raw::c_ulonglong,
        _ElementCount: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_ulonglong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn freopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _Stream: *mut FILE,
    ) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fsopen(
        _FileName: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
        _ShFlag: ::std::os::raw::c_int,
    ) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fsetpos(_Stream: *mut FILE, _Position: *const fpos_t) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fseek(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_long,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fseeki64(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_longlong,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ftell(_Stream: *mut FILE) -> ::std::os::raw::c_long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _ftelli64(_Stream: *mut FILE) -> ::std::os::raw::c_longlong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn fwrite(
        _Buffer: *const ::std::os::raw::c_void,
        _ElementSize: ::std::os::raw::c_ulonglong,
        _ElementCount: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_ulonglong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn getc(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _getmaxstdio() -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _getw(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn perror(_ErrorMessage: *const ::std::os::raw::c_char);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _pclose(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _popen(
        _Command: *const ::std::os::raw::c_char,
        _Mode: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn putc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn putchar(_Character: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn puts(_Buffer: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _putw(_Word: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn remove(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn rename(
        _OldFileName: *const ::std::os::raw::c_char,
        _NewFileName: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _unlink(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn unlink(_FileName: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn rewind(_Stream: *mut FILE);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _rmtmp() -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn setbuf(_Stream: *mut FILE, _Buffer: *mut ::std::os::raw::c_char);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _setmaxstdio(_Maximum: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn setvbuf(
        _Stream: *mut FILE,
        _Buffer: *mut ::std::os::raw::c_char,
        _Mode: ::std::os::raw::c_int,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _tempnam(
        _DirectoryName: *const ::std::os::raw::c_char,
        _FilePrefix: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn tmpnam(_Buffer: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn ungetc(_Character: ::std::os::raw::c_int, _Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _lock_file(_Stream: *mut FILE);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _unlock_file(_Stream: *mut FILE);
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fclose_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fflush_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fgetc_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fputc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fread_nolock(
        _Buffer: *mut ::std::os::raw::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fread_nolock_s(
        _Buffer: *mut ::std::os::raw::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fseek_nolock(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_long,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fseeki64_nolock(
        _Stream: *mut FILE,
        _Offset: ::std::os::raw::c_longlong,
        _Origin: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _ftell_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_long;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _ftelli64_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_longlong;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _fwrite_nolock(
        _Buffer: *const ::std::os::raw::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _getc_nolock(_Stream: *mut FILE) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _putc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _ungetc_nolock(
        _Character: ::std::os::raw::c_int,
        _Stream: *mut FILE,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __p__commode() -> *mut ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vfprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vfprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vfprintf_p(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _set_printf_count_output(_Value: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn _get_printf_count_output() -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vfscanf(
        _Options: ::std::os::raw::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _Arglist: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vsprintf(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vsprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
    pub fn __stdio_common_vsnprintf_s(
        _Options: ::std::os::raw::c_ulonglong,
        _Buffer: *mut ::std::os::raw::c_char,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> ::std::os::raw::c_int;
}
#[link(name = "ZRDDSC_VS2019")]
unsafe extern "C" {
